{
  "publicationDate": "Oct 19, 2018",
  "title": "A Look Back - Dubstep Allstars: A Movement Takes Shape",
  "mainImage": "/cms-content/uploads/dubstepastars01.png",
  "category": "MUSINGS",
  "summary": "A look back at the creation of a genre - and the two DJs whose vision and selection contributed to shaping it - through the first two Dubstep Allstars volumes.",
  "body": "_\"For emerging scenes that have a newness about them, \\[that are] kind of unique and fresh, vital in that way that dubstep was, and in that way that grime was, in that way that 2-step garage was, specialism is really, really important, because it's that specialism that allows the music to unravel and develop. So with a genre like dubstep, there \\[were] DJs like Youngsta and Hatcha, who both produced occasional records, but were essentially specialist DJs. And they put a lot of initially quite disparate music into context as being one thing. And it was that which really honed the sound and made it what it was. It helped people identify with it, I think. It made the music less impenetrable.\"\n_\n\n<SpecialText align=\"RIGHT\" size=\"undefined\" />\n\n_**\\- Ben UFO, Red Bull Music Academy Lecture, 2014\n**_\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n**L**et's go back 15 years.  If you were living in London, you might have been able to pick up the signal from the then-pirate radio station, Rinse FM, at home or in your car. And you might have caught DJ Hatcha's show. You listen closely. The music is dark and bassy. Energetic, earthy and esoteric. It's stripped back for the most part - the percussion and the rumbling bass - with minimal instrumentation put on top, usually a sample taken from whatever exotic/\"ethnic\"/oriental music. And you can faintly hear some 2-step Garage influences in the beat patterns, but the music has already begun to stray away from it.\n\nAnd on top you hear the playful and almost nonsensical chatter of MCs Crazy D (mostly) and Beezy.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n_\"Come on Hatcha! Take them to the jungle! Come on do it! Don't just say it, DO IT!\"\n_\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n_\"Deeper and darker we go! Big up all the one-blingers!\"\n_\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n_\"Going in with full stamina! Wa Wa oooeeee! Ongie Bongie!\"\n_\n\n![](/cms-content/uploads/dubstepastars02.png)\n\n__\n\nFor everyone that was locked in to the show way back in 2003 - from the \"deep heads\" recording the set on cassette, to the likes of the Digital Mystikz, smoking a spliff in their car - listening to Hatcha's selection of underground bass music, that he and Crazy D would call \"Tribal\" or \"Ongie bongie\", what they probably didn't know was that they were listening to the early iterations of what would soon be called Dubstep.\n\nAs Ben UFO (founder of Hessle Audio, one of the most celebrated underground UK labels) says in the above quote, Hatcha was a specialist, honing into a particular sound. In the early 2000s, a whole bunch of producers and DJs, with backgrounds in UK Garage, started making darker, rawer beats at 140 bpm, often with stylistic influences taken from the darker ends of Jungle and Drum n Bass. In 2003, 15 years ago, Dubstep and Grime hadn't yet crystallized into defined genres.  There were different styles going about within the \"140 sound\" diaspora; from the breakstep garage sound, to dark garage à la DJ Narrows, to sublow, eski beat and dubstep. The Dubstep (dubby 2-step garage) term, from what I understand, was initially used to describe Horsepower Productions' output and all of the  music influenced by it, or which resembled it.\n\n<EmbeddedMusic title=\"Horsepower Productions - Fist of Fury\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"250\" src=\"https://www.youtube.com/embed/uCEtbd-DqCw\" width=\"560\"></iframe>} />\n\nComing from a UK Garage standpoint, Hatcha started to notice these new variants coming out: \"_I started to pick up on this new sound; it was Garage, but deeper and darker, more intelligent style_.\" His sets gradually shifted entirely towards this new sound. With a record bag full of exclusive and sought-after dubplates, he became one of the most noticeable and influential DJs of this new quasi-scene, having underground producers make beats specifically for him. Two of  them were Skream and Benga, teenagers at the time. Hatcha quickly started to focus on a specific vibe, and as people sent him music, he'd give back instructions to \"_make it darker, more tribal_.\"\n\nWhen people speak of Dubstep's origins, one place always comes up: Croydon, South London. And early-Dubstep is often referred to as the \"Croydon sound\". That all started with Hatcha. He was an employee at the Big Apple Records shop, which was located in Croydon, and which was the hangout spot for a lot of Dubstep pioneers: Skream, Benga, Artwork, Tunnidge, Cyrus, Distance, Benny Ill (from Horsepower Productions), Hijak, etc. Soon after, the DMZ gang joined this group, who were the ones pushing out this bass-heavy, dark, stripped-back, sometimes tribal sound - the Croydon Sound. Early Dubstep.\n\nCompare this track, the sound that Hatcha prefered:\n\n<EmbeddedMusic title=\"Benny Ill vs DJ Hatcha - Highland Spring\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"250\" src=\"https://www.youtube.com/embed/th1rDR0jgh4\" width=\"560\"></iframe>} />\n\nTo this:\n\n<EmbeddedMusic title=\"Darqwan - Nocturnal (Geeneus Mix)\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"250\" src=\"https://www.youtube.com/embed/34mhcjMQ3E0\" width=\"560\"></iframe>} />\n\nFWD>> (pronounced \"forward\"), was the name of the club night showcasing this new style (among others) and was affiliated with Geeneus' pirate radio station, Rinse FM. The club night was run by Sarah Lockhart and Neil Joliffe, of Ammunitions Ltd, who both also ran Tempa, the most prominent and influential Dubstep label from 2000 to about 2008. Initially a space where Horsepower Productions could release their music, the label's roster grew as producers like Hatcha, Kode9, DJ Abstract, Skream, and DMZ had some of their early work released on there as well. As a way to promote this new music, Tempa saw fit to release an official mix CD as a showcase. Of course, the DJ they would call to make to first volume was DJ Hatcha himself. \n\n**Dubstep Allstars vol 1**, is the first official release with the genre's name. Although the CD came out in 2004, the music appears to be mostly from 2002 to early-2003, as it seems to predate the DMZ era. You can hear it in the music, which still has the 2-step swing into it. Although the mix is missing the lively chatter of Crazy D and Beezy, and even the energy that his radio show had, it still remains a great showcase of the music that initiated this Croydon Sound, with its biggest early players: Kode9, Skream, Benga, Horsepower Productions.\n\n<EmbeddedMusic title=\"Dubstep Allstars Vol. 1 (Mixed by DJ Hatcha)\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/lGOdbP5L-JA\" width=\"560\"></iframe>} />\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\nThe next year saw the release of the second volume of Dubstep Allstars, with Youngsta taking over the decks this time. And this is where the form of Dubstep with which most people are accustomed started to take shape.\n\nYoungsta, Sarah Lockhart's younger brother, was also a South London resident and he'd supposedly been involved in pirate radio since the age of 13, getting his own slot on Rinse FM around 2002. By 2005, due to his unique vision and selection, to his unparalleled technical talents as a DJ, and to his partnership with one of the most unique MCs, Task, Youngsta and his show had grown a sizable following. Now, he is recognized as being probably the most important and influential DJ in Dubstep, as the underground sound still follows the foundation layed out in this second mix CD of the series.\n\nWhile others in this scene were still largely toying with the vibes and rhythms of the darker side of Garage and DnB, Youngsta was more interested in seeing how \"stripped-back\" and \"spaced out\" (his own terms) the music could become. Whereas Hatcha's vision for this music was a rhythmically energetic one, Youngsta's vision brought him to venture further down the minimalist and darker path, and focusing less on the whole \"tribal\"/ethnic aesthetic. The signature groove and swing of Garage music is almost entirely gone here, except for the use of shuffley hi-hats. And he was the one pushing the halfstep sound that everyone associates with the genre, as that familiar beat pattern can be heard in the opening track, Skream's **Babylon**.\n\n<EmbeddedMusic title=\"Dubstep Allstars Vol. 2 (Mixed by DJ Youngsta)\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/zUXllMiXH2g\" width=\"560\"></iframe>} />\n\nMaking an appearance is the DMZ crew, who make up almost half of the mix. In fact, as Ben UFO also points out in his interview with Red Bull Music, Youngsta was such a specialist, had such a specific taste, that his sets were composed entirely of music from a handful of producers: Mala (of the Digital Mystikz), Loefah, D1, Skream, and sometimes Benga and Coki. That was it, six producers; and only four of them are presented in this mix CD.\n\nDark and atmospheric, the music in this mix is more meditative than actually danceable, but that was the idea. Youngsta didn't do sets to skank to, but to light up a blunt to, and bob your head to the beat, eyes down, as you feel the enormous sub pressure rattle your rib cage.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\nBritish underground club music in the early 2000s was probably like what it is now, with different styles floating about, subgenres of subgenres, with a similar vibe threading along each sound, but without any one of them crystallizing to form a new genre. In the early 2000s, underground Garage spored many different styles. While DJs like Slimzee and Geeneus took from that pool to shape what we now know as \"Grime\", Hatcha and Youngsta had also taken from that very same pool, to shape what we now recognize as being \"Dubstep\". And while some of their archived radio sets have been uploaded on Soundcloud and Mixcloud, Tempa's first two entries of their **Dubstep Allstars** series remain great points of reference to listen to where the genre comes from, and who built it.\n\n![](/cms-content/uploads/dubstepastars03.png)"
}