{
  "publicationDate": "Sep 04, 2018",
  "title": "The Past is Now. The Future was then.",
  "mainImage": "/cms-content/uploads/past.png",
  "category": "MUSINGS",
  "summary": "While some, like me, will decry the ongoing retroism as a force of creative stagnancy, maybe there's something to it, an energy worth preserving.",
  "body": "It's the evening, and I'm listening to George Clanton's newly released _Slide_. It's an enjoyable synthpop album. Great melodies, cool sounds, yadda, yadda, yadda. However, what is striking to me about this album, is how its retro sound _isn't striking_. The synth work and the sampled drum breaks entirely assume a 90s vibe, but never does it sound novel.  I think it's safe to say that retro sounds are no longer particular or audacious stylistic choices in music. It's as if we've accepted the sounds from  the past into our current lives. They are just a palette among many. In Google Play, in Spotify, in Youtube, I have at my fingertips an immense collection of music from every era. When it comes to modern music (i.e. from the 60s onwards), everything falls into a sort of musical mosaic while listening on a digital platform.\n\n<EmbeddedMusic title=\"George Clanton - Slide\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"266\" src=\"https://www.youtube.com/embed/kieVYydeEOQ\" width=\"560\"></iframe>} />\n\nHow could it not? So many modern acts borrow directly from the past. Sure, there are some modern tendencies, notably when it comes to lyrical content, vocal melodies and vocal delivery in pop music, that distinguish them from older styles. But when it comes to song arrangements and instrumentation, past works serve as inspiration, to the point where it's not just inspiration but imitation at times.\n\nI think of electronic music right now. I wrote the article highlighting what I considered as \"[the new Hardcore](https://www.thenextgroove.site/article/20181123_uk-techno-bass-percussion-bass-hard-drums-the-new-hardcore)\" in UK rave music. I also consider it as being \"new\" and \"fresh\". But let's just think about everything else. Look at House music. In 2006, Loefah said in a dubstep documentary that \"_House and Techno have been doing the same thing for 10-15 years_\". It's 2018 now, and House is still the same. Same tempos, same chord progressions. Mostly, look at Lo-fi  House, probably the biggest underground electronic genre in the last few years outside of Big Room/Festival Techno (is that still considered \"underground\"?). The genre is shamelessly retro, not only in its sound but in the names that some producers have given themselves (DJ Seinfeld? Ross from Friends?). It's biggest hit is probably DJ Boring's \"Winona\". \n\n<EmbeddedMusic title=\"DJ Boring - Winona\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"266\" src=\"https://www.youtube.com/embed/ar9qA3WJInk\" width=\"560\"></iframe>} />\n\nLo-fi House's main characteristic is its fixation on the past, a whole scene dedicated to sonically reliving the past. But the retro fixation is also present in other genres. Jungle and Drum N Bass are going through a resurgence in interest right now. And while there are certainly labels that are trying to push fresh stuff, there is no ignoring the continued veneration of the 90s sound, especially when it comes to Jungle. Tim Rearper, Coco Bryce, Pheneus II, Dead Man's Chest are but some that have given a new life to the Jungle sound of '93, when Jungle still had a heavy House influence. This year also saw the release of a compilation titled _Hardcore Will Never Die_, for which various modern producers made Hardcore/Breakbeat Techno tracks as a showcase.\n\nIn Techno, the old Detroit sound lives on as a major influence for a lot of producers. Even in Dancehall, I've recently realized that some of my preferred riddims are callbacks to the 80s and/or 90s. And, as I've stated in my Mala entry, underground Dubstep continues to gravitate around a _fetishization _of the \"true sound\", the 2006 sound, the DMZ and Tectonic sound. As such, the music is still the same thing as it was back then.\n\nActually, to say that \"it's still the same thing\" is a bit unfair. I can only guess as to why a younger generation of producers is so fascinated with the past when, usually, in Electronic music, it is the notion of the future that is an important source of inspiration. There was a time when Electronic music's \"evolution\" was dictated by technological advancements and  a growing accessibility of recording and studio equipment. But we seem to have plateau'd (for now) in that regard.\n\n<EmbeddedMusic title=\"Etch - Dreamst8\" iframe={<iframe allow=\"autoplay\" frameborder=\"no\" height=\"166\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/444292581&amp;color=%23ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true\" width=\"100%\"></iframe>} />\n\nIn terms of underground Electronic music, the 80s and 90s were wild years. But I, like everyone aged under about 35, only know so through reading about it and listening to the available music. The music from those years still serves as a sort of guide (or template) for what is current (well, maybe not for the whole \"deconstructed/post club\" thing). Even more \"modern\" sounding stuff like Bass House can find some of its stylistic origins in Tear Out Drum N Bass, French House and Trance from the 90s. And so, when we read about how those years have been mythologized by older ravers, and when we listen to the music and hear how it's so distant and different, yet so familiar, of course people are bound to be fixated on it.\n\nA certain longing arises for those \"mythological\" years, regardless if someone \"was there\" or not. We hear how incredibly vital Hardcore and Jungle were, but those scenes were at their peak for only a couple of years. At the time, most people were intent on \"moving things forwards\", with \"finding the new\": \"_That amazing track that came out 6-7 months ago, that's old history now._\" So producers take those old aesthetics, and bring them back, make them new again. Because maybe we want to experience them now, live them in our own way. Because maybe there still might be possibilities for new explorations using those old aesthetics.  Could someone in '95 have made a track like Subjoi's \"The Way I Feel**\" **or Mall Grab's \"Feel U\", or Denham Audio \"Cinnamon Vanilla\", or Dead Man's Chest \"Avalon Dub\"?\n\nThe answers is: who knows. Maybe. Maybe not. There was a time when innovation was the name of the game in Electronic/Club/Rave. It seems as if innovation might be a tad overrated.\n\nSo just let's just listen and enjoy the music, and maybe ignore everything I've just written.\n\n<EmbeddedMusic title=\"Dead Man's Chest - Avalon Dub\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/CDLrczpYT3o\" width=\"560\"></iframe>} />\n\n<EmbeddedMusic title=\"Denham Audio - Cinnamon Vanilla\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/K7Y-GG-57BM\" width=\"560\"></iframe>} />\n\n<EmbeddedMusic title=\"Mall Grab - Feel U\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/FHm5H3OfvPM\" width=\"560\"></iframe>} />\n\n<EmbeddedMusic title=\"Subjoi - The Way I Feel\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/8lfzOSdFeSg\" width=\"560\"></iframe>} />"
}