{
  "publicationDate": "Aug 22, 2018",
  "title": "Boddika's Drum-Machine Music",
  "mainImage": "/cms-content/uploads/boddika.jpg",
  "category": "MIXES",
  "summary": "As part of the Swamp 81 crew in the early 2010s, Boddika transitioned from DnB to weighty, leftfield Techno and Electro inspired by American Ghetto Bass Music.",
  "body": "Do you remember 2011? 2012? Do you remember when Nights Slugs sounded like the future? When Future Garage was still a thing? When the Butterz crew initiated the \"Grime Revival\"? When Marcell Detmann and Ben Klock were making techno cool again? When the aggro, \"bro\" side of Dubstep spearheaded the global takeover of festival EDM culture?\n\nA last one: Do you remember when Swamp 81 was one of the coolest, trendiest labels and crews in underground electronic music?\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\nSwamp 81 was founded in the late 2000s by DMZ member and Dubstep pioneer, Loefah. Discouraged by the direction the genre had taken, he started his new label in order to push a sound that aligned itself more with his tastes. The first few releases - notably from Kryptic Minds - are characterized by a return to Dubstep's \"roots\" (the noisy, aggressive sound was overtaking the scene by then) : the dark and minimal, halftime style.\n\nBut the label took a sudden turn in 2010 with its 5th release: **Addison Groove**'s (aka **Headhunter**) 12\" record with \"Footcrab\" (and \"Dumbshit\" on the B-side). It became an immediate hit in the underground. The Juke-inspired, lo-fi, bassy, drum-machine track sounded like nothing else in Dubstep.\n\n<EmbeddedMusic title=\"Addison Groove - Footcrab\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/gWfiog1Ure4\" width=\"560\"></iframe>} />\n\nThe British had just discovered (or re-discovered) America's \"Ghetto Bass\" music from the 90s: Starting with Juke and Footwork, then with Ghettotech and Ghetto House; all from Detroit and Chicago. Also worth mentioning, Trap's 808-infused beats was beginning its ascension right about then.\n\nQuickly, Loefah's interests shifted towards this \"drum-machine\" styled bass music, exploring the past while trying to push fresh, new sounds. Hyped by the two most influential music journals in underground electronic music, Fact Magazine and Resident Advisor, the label also became an influential force. In the early 2010s, Loefah was joined by like-minded producers such as the Hessle Audio co-founder Ramadanman (now known as Pearson Sound), Addison Groove, Mickey Pearce, UK Garage legend Zed Bias, Paleman, Joy Orbison...\n\nAnd, of course, **Boddika**.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\nBoddika's musical origins are in Drum N Bass, as one-half of** Instra:mental**. The duo was active in the 2000s, initially pushing a sound reminiscent of Metalheadz, and collaborating with Drum N Bass pioneers and heroes, Source Direct and Jonny L. It was good music, but it wasn't anything that distinguished itself from what had been done, and what was being done, in the genre. However, by the end of the decade, they started to explore a more moody, emotional and sometimes cinematic side to their style. Throughout 2009, Jon Convex (aka Kid Drama), the other half of Instra:mental, did a series of podcasts with D-Bridge, taking this style further and further. It came to be known as the \"Autonomic\" sound, which was the name of the podcast.\n (A great write-up of this is done [here](https://godisnolongeradj.wordpress.com/2017/01/25/tracks-i-wish-id-written-issue-8-instramental-photograph/))\n\n<EmbeddedMusic title=\"Instra:mental - Sakura\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/8Kp_0kiSKaA\" width=\"560\"></iframe>} />\n\nThe duo also ventured out of Drum N Bass, going into Electro, Techno and House territory,  dropping all the way down to the 130-140 bpm range. Their last big hurrah before their split was a career-defining LP,** Resolution 653**, released in 2011, in which they leaned towards an experimental Electro and Techno sound. By then, they had fully assumed a \"drum-machine\" sound,  taking it to its extremes. Although the duo split, Boddika made this sound his own. In Swamp 81, he found a place were he could foster it. (He also released music on other labels such as Sunklo, \\[NakedLunch], and his own Nonplus+.)\n\n## The Mix\n\n<EmbeddedMusic title=\"Boddika Showcase Mix\" iframe={<iframe allow=\"autoplay\" frameborder=\"no\" height=\"300\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/487023597&amp;color=%23ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true&amp;visual=true\" width=\"100%\"></iframe>} />\n\n_The tracklist is at the end of the article._\n\nThis showcase starts with two Instra:mental tracks, \"Forbidden\" and \"Futurist\", in order to establish a contrast with the rest of the mix. The first one, while being in the 130 bpm range, is incredibly reminiscent of Boddika's Drum N Bass roots. The second is a good example of the \"Autonomic\" vibe they were doing. Notice how, in \"Forbidden\", the production has a warm tone to it: it's very clean-sounding and polished. In \"Futurist\", their goal is to create a sort of moody reverie, with a \"lush\" production style. Then, \"Faint\", a collaboration with two Swamp 81 label-mates, goes straight into what I call \"Drum-Machine Music\", as practiced by Boddika and the rest of Don Loefah' crew.\n\nGenerally, in electronic music , the machines (or the plug-ins) used to create the music  are tools that serve a whole. Each sound emitted by these machines are building blocks for a composition. Especially now, and recently, everything has to be \"polished\", rounded. The aesthetic is the mood this \"whole\", the composition, creates. \n\nBut with Boddika, the machine is the aesthetic. The machine manifests itself, calls attention to itself. Its textures and artificiality are made evident. Notice the raw, unpolished drum sounds throughout the mix, and the sharp hi-hats. Almost all of the drum sounds are dry (\"dry\" as in \"no reverb at all\"). In \"Rubba\", even the snares are ridiculously snappy. If UK Garage was all about off-beat swing, then Boddika has the _swing _dial turned all the way down. It's as if his beat patterns are limited to what an old drum-machine's interface is able to do. The music sounds very \"modern\", but, like listening to an old Electro track, it's incredibly obvious that a machine is making this sound.\n\nThis \"drum-machine\" approach affects everything. Notice the synths, how they're shaped into twisted, sometimes atonal, forms, going in and out through clumsily applied filters and dials, having a life of their own,  and almost ignoring the notion of harmony. Just like the hi-hats, they're razor-sharp and direct. \"You Tell Me\" takes this aesthetic to its extreme, with its off-key melodies and the ear-bleeding LFOs being torn apart. And notice the drum-machine jam that is** \"**Beats Me\", in which the backing speech sample (a sensual voice like in an old Chicago House track) is manipulated and deformed as to become incomprehensible. Again, it's the machine, the artificial nature of the music, that is highlighted. It directs and informs the composition.\n\nAll of this is done deliberately. As we have seen, Boddika is able to create a \"polished\" sound if he wants to. But his goal, in the early 2010s, was to create raw and immediate beats, influenced by American \"Ghetto Bass\" music and the UK Hardcore's fixation on the groove (percussion and bass dynamic).\n\nThe mix ends with the one-two punch assault of \"In Here\" and \"More Maim\". Both were released in 2014 on the same 12\" record on Sunklo (his and Joy Orbison's label where they released their collaborations). And both represent, at least for me, the end of Boddika's drum-machine era. Since then, he has transitioned into to a more by-the-numbers techno sound, focusing on releasing other people's music on his own Nonplus+ label.\n\nThis aesthetic in dance music isn't exclusive to him. Of course, he takes it to another level, but it's an approach others have also done, whether in [Dancehall](https://www.youtube.com/watch?v=_4KFkgloz0k), in [House](https://www.youtube.com/watch?v=bfpoXeOnfbg), or [Dubstep](https://www.youtube.com/watch?v=_cWgvo6TtZQ). The Swamp 81 crew were simply some of the practitioners.\n\nTracklist:\n\n<SpecialText align=\"undefined\" size=\"SMALL\" />\n\n* _00:00_\n  * Instra:mental - Forbidden (Apple Pips)\n* _02:57 _\n  * Instra:mental - Futurist (NakedLunch)\n* _05:32_\n  * Joy Orbison, Boddika & Pearson Sound - Faint (Sunklo)\n* _06:46_\n  * Boddika - Crack (Swamp 81)\n* _08:44_\n  * Boddika - Syn Chron (NakedLunch)\n* _11:12_\n  * Boddika - 2727 (Swamp 81)\n* _14:00_\n  * Boddika - Basement (Swamp 81)\n* _15:47 _\n  * Boddika - You Tell Me (Nonplus)\n* _19:26_\n  * Boddika - Beats Me (Nonplus)\n* _21:00_\n  * Boddika - Rubba (Swamp 81)\n* _23:37_\n  * Joy Orbison & Boddika - In Here (Sunklo)\n* _26:20_\n  * Joy Orbison & Boddika - More Maim (Sunklo)\n\n![The man himself](/cms-content/uploads/boddika02.jpg)"
}