{
  "publicationDate": "Nov 23, 2018",
  "title": "Showcase Mix : Mala's Bass Mutations",
  "mainImage": "/cms-content/uploads/mala.jpg",
  "category": "MIXES",
  "summary": "The OG sound of Dubstep lives on and flourishes in the underground by the hands old and new players. A good time, then, to revisit Mala's own bass excursions.",
  "body": "Earlier in the year, Red Bull Music wrote an article, stating: \"[**Why dubstep is back at the cutting edge in 2018**](https://www.redbull.com/gb-en/dubstep-back-at-cutting-edge)\".\n\nAnd Plastician, one of the scene's originators, thinks it might be [flourishing soon](https://twitter.com/Plastician/status/969288617880375296), or even right now.\n\nEver since the Brostep explosion dissipated and the style was relegated to the margins of the EDM/Festival culture, the underground Dubstep scene, keeping the spirit of the original sound alive, kept trudging on. The \"Dungeon Sound\" came and went. Soon after, around four years ago or so, a new school of producers started playing with new sound palettes, taking cues from other genres like Halftime, Riddim, Grime, and Trap, but always staying within the familiar template. The music is essentially the same. Stripped-back, spaced-out beats. Leftfield inclinations. And, of course, a hefty, low-end subbass. All at around 140 bpm.\n\n<EmbeddedMusic title=\"Chokez - Konichiwa\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/k8WeM7iVank\" width=\"560\"></iframe>} />\n\nAnd while this new school has brought some needed freshness to the genre, the strict adherence to the halftime beat pattern  (i.e. accentuated first and third beat on every measure; typically with a kick on the first and a snare on the third) makes me wish that there was more rhythmic variety. The underground Dubstep scene has always given itself the mandate of \"keeping the original sound alive\", while worshiping the early players. But, ironically, rhythmic variety is a lesson they could draw from the early days, from before everyone and their mothers started doing the halftime beat.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\nEnter **Mala**.\n\nFor the uninitiated, Mala is one half of the Digital Mystikz (the other half being his childhood friend, Coki). With their other two friends, Loefah and Sgt Pokes, they formed DMZ - a crew, a label and, eventually, a club night. This South London quartet has always been given the credit in having the biggest part in shaping the Dubstep sound. I don't think that's entirely accurate, but, certainly, when it comes to that older era, no one is more celebrated than them.\n\n![The DMZ gang, live and direct](/cms-content/uploads/mala02.jpg)\n\nWhile Mala isn't my favourite producer from that time (that would be either Loefah or D1), I feel that his discography gives a great glimpse into why Dubstep was such a great genre in its genesis. I think now is a good time to revisit Mala's early Dubstep explorations (from around 2003-5).\n\nDubstep hadn't yet become formulaic back then. There were two rules: around 140 bpm (emphasis on \"around\") and subbass. That was it.\nPeople brought they're own styles to the table. Influences ranged from UK Garage - notably its 2-Step variant (hence the \"step\" in \"dubstep), Jungle, Drum n Bass, Minimal Techno, Broken Beat, Dancehall and Dub Reggae.\n\nMala and Loefah have stated in interviews that, at the time, they were simply looking for something new, something fresh and exciting. It wasn't necessarily to invent or come up with a new genre, but to participate in a scene that encouraged new ideas, at a time when Drum N Bass, UK Garage, House and Techno had become, according to them, creatively stagnant.\n\n## The mix\n\nSo here's a showcase mix of Mala's music. A selection of some of my favourite beats of his, that I feel give a good idea of his sound. Also note that a lot of tracks were released under the \"Digital Mystikz\" moniker, but the duo rarely produced tracks together. These are all Mala productions. The tracklist will be put at the end of the article.\n\n<EmbeddedMusic title=\"Mala - Showcase Mix\" iframe={<iframe allow=\"autoplay\" frameborder=\"no\" height=\"300\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/482513505&amp;color=%23ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true&amp;visual=true\" width=\"100%\"></iframe>} />\n\nHis drum sounds have an earthy tone to them, sometimes even going for a tribal feel. Compared to almost all electornic music, they lack a certain polish, but their rawness gives them a lot of character, a lot of grit. They're accompanied by shuffling, offbeat hi-hats and an array of percussive sounds. And all of that is propelled by a bouncing subbass made for sound systems.\n\nThe music is dark and haunting; meditative and apocalyptic. Notice the melancholic instrumental samples paired with the Jah/rastafarian vocals. And notice the ominous piano notes in** Bury Da Bwoy**. But Mala's groove gives it a dynamic energy that still sounds unique, and that works for both the skankers at the rave and the head nodders listening at home.\r\n\nThe second half  of the mix, especially, showcases the rhythmic variety that Mala practices. Notice how in tracks like **Neverland**, **Awake **and** Da Wrath**, it isn't the first and third beats of every measure that are accentuated. The music has more of a \"jump-up\" feel rather than a halftime one.\n\nTracks like **Conference **and **Walkin' With Jah** go into some warped, tribal affair and broken beat patterns. The former making use of hand-slapped afro-percussion samples. And the latter, using the sounds of distant, rolling tribal drums, and all of it backed-up by a gurgling, cavernous subbass leading to atonal strings.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\nIn the early 2000s, music like this made people think about what rave music could be, and what electronic music could be. By revisiting early Dubstep, even the current players could think about what Dubstep can be, and, I hope, free themselves from the stranglehold of the formulaic halftime beat pattern.\n\nLastly, Mala's music, putting the emphasis on the percussion and bass, also fits with the current trend of \"Percussion/Bass\" music of the underground UK scene, showing how the same sort of musical tendencies, elements and ideas can come out in new genres with fresh results. Anyone who enjoys the current tribal and percussive sound should find something that they like in, not only Mala's, but early Dubstep's body of work.\n\nTracklist:\n\n<SpecialText align=\"undefined\" size=\"SMALL\" />\n\n* _00:00_\n  * **Mala - Changes\r**\n* _04:36_\n  * **Digital Mystikz - Misty Winter\r, **\n* _07:02 _\n  * **Digital Mystikz - Chainba\r**\n* _09:22 _\n  * **Bury Da Bwoy\r**\n* _11:54_\n  * **Digital Mystikz - Neverland\r**\n* _14:53_\n  * **Digital Mystikz - Awake\r**\n* _18:06_\n  * **Digital Mystikz - Conference\r**\n* _20:50_\n  * **Digital Mystikz - Da Wrath\r**\n* _23:07_\n  * **Digital Mystikz - Walkin' with Jah\r**\n* _26:00_\n  * **Mala - Alicia\r**\n    ****"
}