{
  "publicationDate": "Oct 04, 2018",
  "title": "Old School House Music (made in the 21st Century)",
  "mainImage": "/cms-content/uploads/showhouse.jpg",
  "category": "MIXES",
  "summary": "This Showcase Mix entry is comprised of some song-based House music that I've been feeling a lot lately. 21st Century House music with an old school vibe!",
  "body": "Consider this statement: \"Jungle has House influences\".\n\nYou say: \"Ok...\"\n\nAlso consider: \"Jungle also has Techno influences.\"\n\nAnd you might be left wondering: What, exactly, is House? What, exactly, is Techno? And how can people distinguish one from the other?\n\nLet me try and give a description. Techno is _machine music_. Usually instrumental, it has a steady, repetitive rhythm; it's not too slow, but not too fast. It can sound grey and atonal, or even, at times, bright and melodic. Created in the 80s in Detroit, it takes massive influences from West Coast P-Funk and 70s German electronic music, taking the German motorik pulse and putting it in a dance/club environment.\n\n<SpecialText align=\"CENTER\" size=\"SMALL\" />\n\nKraftwerk's **Die Roboter \\[The Robot]**, an example of German electronic music\n\n<EmbeddedMusic title=\"Kraftwerk - Die Roboter [The Robot]\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"266\" src=\"https://www.youtube.com/embed/MUW_6YkMRF8\" width=\"560\"></iframe>} />\n\n<SpecialText align=\"CENTER\" size=\"SMALL\" />\n\nRobert Hood's **Detroit: One Circle**, an example of Detroit Techno\n\n<EmbeddedMusic title=\"Robert Hood - Detrot: One Circle\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"266\" src=\"https://www.youtube.com/embed/uH7u1ZeRK34\" width=\"560\"></iframe>} />\n\nAnd House? Well, House is also dance/club music with a steady, repetitive rhythm (not too fast, not too slow) created with the help of drum-machines. But House is _soul music_. Originating in Chicago, sometime in the late 70s, its sound stems from the long tradition of R'n'B. While Chicago House is usually instrumental, and can be stripped back like Techno, it has an evident Funk and Disco groove to it. The Garage House variant from New York, also from the late 70s, is more song-based, with its Disco, Soul and R'n'B (and even Jazz) influences made much more apparent.\n\n<EmbeddedMusic title=\"Patti LaBelle - It's Alriht With Me\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"266\" src=\"https://www.youtube.com/embed/iHgzxHwGdCw\" width=\"560\"></iframe>} />\n\n<EmbeddedMusic title=\"Marshall Jefferson - Move Your Body\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"266\" src=\"https://www.youtube.com/embed/jwhE9g7r9qU\" width=\"560\"></iframe>} />\n\n<EmbeddedMusic title=\"Soundstream - All Night\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"266\" src=\"https://www.youtube.com/embed/J0Z8FUYUkZ0\" width=\"560\"></iframe>} />\n\nOf course, Techno and House, despite its purists, have always co-existed and, in turn, influenced each other. Some tracks could be categorized as both, making things frustrating for people who need to have things neatly classified. But I can confidently say that Robert Hood's classic \"Detroit: One Circle\" is unquestionably Techno, and that Marshall Jefferson's and Soundstream's posted tracks are indeed House, through and through.\n\nAt this point, House music is already about 4 decades old, and there seems to be no sign of it slowing down. For four decades, with all of the stylistic changes it has gone through, it is essentially the same thing. Same vibe. Same formula. Even now there are still masses of House producers sampling Jazz, Funk, R'n'B and Disco records (some even specializing in making Edits of old Disco joints): A testament to how the genre has stuck to its roots, to its musical heritage, and, to a certain extent, to its original sound. House music has, in my opinion, become a classical genre. \"Classical\" in the sense that it has its own unchanged, traditional conventions that are able to host new and foreign elements without having them alter the essence of its sound. While I'm the type of listener that likes to look for the new (and that is in perpetual search for the new), it is impossible no to commend its long-lasting appeal, and how much great music this genre continues to give.\n\n## The Mix\n\nSo, for this showcase mix, I thought I'd make one with House tracks that are more \"song-based\", for every listener that has also wondered what House music is.  Well, this is it. This is No Nonsense House Music. 4-4-2 House Music. \"Just Punt the Ball Away!\" House Music. Pepperoni and Pizza House Music. No fusion elements. No generic ambiguity. No musical hybridity with new, current genres, or Techno, or anything else. Just a steady rhythm with funky basslines, jazzy chords on synthesizers, upbeat piano, Disco-styled strings, soulful R'n'B singers, and divas.\n\nThe music here falls more in line with the New York Garage version of House. And to offer something different from the classics that we hear over and over again, I thought I'd select tracks made after 2000 that have an old school feel. If the track is relatively recent, and if Larry Levan would've probably liked it, then it's going in. I hope you enjoy.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n**_♪♪ 'Cause House is a feeling! ♪♪_**\n\n<EmbeddedMusic title=\"Soulful House Showcase Mix\" iframe={<iframe allow=\"autoplay\" frameborder=\"no\" height=\"300\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/509637738&amp;color=%23ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true&amp;visual=true\" width=\"100%\"></iframe>} />\n\nTracklist:\n\n* _00:00_\n  * Quentin Harris - My Joy\n* _04:21_\n  * Full Intention - I'll Be Waiting (Gray & Pearn Remix)\n* 07:48\n  * Hardsoul feat. Amma - Don't Let Love Weigh You Down (Original Classic Mix) \n* _12:00_\n  * Janet Jackson feat. Nelly - Call On Me (Disclosure Bootleg)\n* _14:04_\n  * Stephanie Cooke - Rain (Let It All Come Down) (Dennis Ferrer's Rainforest Mix) \n* _18:52_\n  * Frankie Knuckles - Let's Stay Home (A Director's Cut Classic Club Mix) \n* _22:27_\n  * Joi Cardwell & DJ Gomi - We Can Do Better (Fred Everything Lazy Vocal Mix) \n* _26:02_\n  * Julian Gomes - Love Song 28 (Original Mix)"
}