{
  "publicationDate": "Sep 26, 2018",
  "title": "Peverelist's Bass Music: Jungle Re-Contextualized",
  "mainImage": "/cms-content/uploads/pev01.jpg",
  "category": "MUSINGS",
  "summary": "It's interesting to think about musical influences, whether it's how a certain genre, artist, scene, or track has influenced another certain genre, scene or artist, and so on.",
  "body": "It's interesting to think about musical influences, whether it's how a certain genre, artist, scene, or track has influenced another certain genre, scene or artist, and so on. To think about musical influences is to think about how musical elements and styles tend to get passed on, from one era to another; about how they survive (or die, if ignored), and how they're used to create something new.\n\nOne of my favourite electronic music producers is undoubtedly **Peverelist**. In wanting to promote fresh bass music from his city of Bristol, he started the _Punch Drunk _label in 2006. Even before its Brostep variant took over the EDM festival circuit in 2010, Dubstep was all the rage in the underground. The subbass-powered, dread-filled, skankstep sound from London sounded like nothing before. And as with Jungle and Drum N Bass, the sound promptly made its way to the port city. Notable producers in the genre that have appeared on Peverelist's label are: Pinch, Gemmy, RSD (from the legendary Bristolian act, Smith & Mighty), Kahn, Shorstuff (aka Mickey Pearce), etc. \n\n<EmbeddedMusic title=\"Pinch - 136 Trek\" iframe={<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/eYoTTvDnb2A\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nEver since the start of Rave and Hardcore, Bristol has, from what I've read here and there, always been in the shadow of the capital. But maybe that is less so today. In 2011, Peverelist starts a second label, _Livity Sound_. Possibly because of his waning interest in Dubstep (which had become formulaic by then), the label served as a venue to push out forward-thinking, yet still club-oriented, bass music from a crew of Bristol producers. Livity Sound, in a way, was a continuation of the Techno-infused Dubstep style that was going on in the late 2000s (which the Punch Drunk label also showcased). But the tempo had changed, going from 140 to about 125-130, stepping away from the Dubstep scene. As with the labels Swamp 81, Night Slugs and Hessle Audio, Livity Sound's output is an important pillar of the current \"UK Hardcore\" sound going on right now (which I wrote about [here](http://patkardenaz.blogspot.com/2018/08/uk-techno-bass-percussion-bass-hard.html)). While it has settled into a certain comfort zone in the last two years, the label's  prior willingness to takes chances and surprise  has made it one of the most influential and important labels of this decade in underground electronic/club/rave music.\n\nPeverelist, the label boss, the don, is at the center of it. Although he started in the Dubstep scene, and his current music can be lightly qualified as \"Techno\" or \"UK Bass\" (depending on who you ask), to my ears, he's always made the same music. Sound system music: Bass music that follows the UK Hardcore tradition. Throughout his discography, one idea that comes back, ever since his first releases, is his tendency to fuse the attacking, ricocheting subbass of Jungle and Drum N Bass with the established machine-soul sound of (Detroit) Techno. The Dubstep genre, I believe, was initially the perfect space to try this, at a time when it still seemed like there was uncharted territories to explore in the genre, over 10 years ago.\n\nPeverelist has a sound of his own that is instantly recognizable. Outside of his preferred hi-hats, warm kicks and melancholic synths, the element that gives his music his own signature style in the realm of Techno is the dizzying grooves he takes from Jungle and Drum N Bass. This made sense to me when he's said in interviews that his roots, as a DJ and raver, lie in those genres. Back in 2012, he uploaded an old Jungle mix he made sometime in the late 90s (listen [here](https://youtu.be/an_doDWB_ow)). \n\nLet's take a look at two tracks taken from that mix: Shut Up & Dance's remix of The Godfather's \"Somebody\", released in 1995 on Red Light; and \"Never Felt\", by an anonymous artist, released in 1995 on Hard 'N' Heavy. A chance to get acquainted with Peverelist's own musical influences.\n\n<EmbeddedMusic title=\"The Godfather - Somebody (Shut Up & Dance Remix)\" iframe={<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Wi-NN9lPLVc\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\n<EmbeddedMusic title=\"Unknown Artist - Never Felt\" iframe={<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/PZU9fBJAaFI\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nOne of the main characteristics of Jungle is the drum breaks manipulation at fast tempos. Not unlike Hip Hop, the breaks are sliced up and re-assembled however the producer wants to. However, in Jungle, the breaks are put together in a unpredictable fashion. There is a dominant beat pattern in each track, but the producers have fun and deviate from it by offering different variables after every couple of bars or so, without interrupting the groove (for the skankers at the rave). Different percussive elements are highlighted at different times: skittering attacks from snares or hi-hats, or cymbals (or even applied filter effects) that cut out as suddenly and quickly as they jumped in. This creates that dizzying, offbeat swing that is intrinsic to the genre. A world apart from both House and Techno's motorik beats.\n\nAlso pay attention to the bass underneath all that. In a lot of cases, I don't think we can talk about bass lines. \"Bass line\", to me, implies a player, a musician, that has everything seemingly under control. The bass in Jungle is anything but that; it's an untamed beast. Notice how, in both tracks, at every 2 bars or so, the subbass jumps in, bouncing around rapidly and successively, almost as if it wanted to burst out of the speakers, before sliding down and subduing itself momentarily, until it jumps in again. With the percussion on top, it creates a feeling of chaos and, with it, a spike in energy.\n\nIn regards to the bouncy, offbeat bass, and how Peverelist uses that stylistic element within a Techno track, let's take a look at two of my favourites from last year: his remix of Roberto's \"Chord Recall\"** **(Solar Phenoma) and his own** \"**Wireframes: (Livity Sound). [_\\*Note: Listen with headphones or speakers with adequate bass response_]. Notice the bass in his re-imagining of \"Chord Recall\". That ricocheting, offbeat subbass, almost straight out of a Jungle track, jumps in at the start of every bar. Stylistically, the reverberated chords echoing throughout are fairly typical of Techno. But, until the strings come in at midpoint, the immense bass takes center stage, giving the track weight, forward momentum and a dizzying swing.  In \"Wireframes\", the same idea is applied, but we can hear some percussive work come into play. The offbeat subbass attacks paired with the kicks create the same effect as in the \"Chord Recall\" remix. Peverelist layers in swinging hi-hats, snares and claps that dance around the bass. None of the elements ever seem to stay put.\n\n<EmbeddedMusic title=\"Roberto - Chord Recall (Peverelist Remix)\" iframe={<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/heLHtSw6YeE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\n<EmbeddedMusic title=\"Peverelist - Wireframes\" iframe={<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/OO0bvOR1lWs\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nFinally, let's take a look at one of his \"Dubstep\" tracks, from his Punch Drunk label: Fighting Without Fighting, released in 2010. This is the track that actually brought me to think about how Peverelist utilizes his Jungle influences to create new music. In this track, the chaotic impulses of Jungle are present, in both the percussion and the bass. The bass is relentless; again, it bounces around continuously, with almost no break to its assault on your speakers. While the drum breaks aren't there, listen to the snares and hi-hats. They're spastic, uncontrollable, unpredictable. The hi-hats sometimes come and go as they please. There's no fixed motif with the beat pattern. Peverelist adds his touch, with the melancholic melodies and restrained Techno chords which give the track some type of shape that the listener can grasp onto. Sure, it doesn't have the rudebwoy swagger of Jungle, but this track definitely shares its sense of controlled chaos; and I think that there is definite lineage to be traced here.\n\n<EmbeddedMusic title=\"Peverelist - Fighting Without Fighting\" iframe={<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/6n3hql89KZI\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nIs \"Fighting Without Fighting\" actually Dubstep? Or is it Jungle? Or is it both? When I heard the track, I didn't know what to make of it. Only when I realized that Peverelist might be trying, as previously mentioned, to seamlessly combine Jungle/Drum N Bass and Techno did I start to make sense of it. As I stated in the opening paragraph, I found it interesting to see how someone's musical baggage affects their compositions, how they might use it, re-contextualize it, to create something fresh, something yet unheard. Jungle and Drum N Bass aren't viewed as \"forward-thinking music\" anymore, but their sound lives on in music that is considered as such. At least, people like Peverelist are seeing to it."
}