{
  "publicationDate": "Dec 06, 2018",
  "title": "The New Hardcore - Part Deux",
  "mainImage": "/cms-content/uploads/hardcorep2.png",
  "category": "PLAYLISTS",
  "summary": "Another year has passed. Instead of making of list of albums, I thought I'd switch things up a little and make a list of mixes centered on the \"new Hardcore\".",
  "body": "As we reach the end of another year, and with just under a month left until the  31st, the bombardment of end-year lists throughout the whole sphere of music journalism has already begun. Journalists and critics are expected to do so, as the eagerly awaiting music geeks look for what the past 12 months had the best to offer according to these authoritative voices, who in turn will be personally insulted or praised, and whose opinions will be vehemently dismissed or maybe even given approbation. Putting together these year-end lists is a great way to reflect about the music we have enjoyed throughout the year, about why we enjoy them, and what they mean to us or what they mean in the grander scheme of things.\n\nIn one of my most recent articles, in which I shared a mix of \"new school\" old school Hardcore, I reflected about the revivalism of Hardcore from these last couple of years, about the paradox of _reviving and imitating the sound of a past scene that sought to innovate and which looked towards the future_. And I said that we should try to imitate the spirit of Hardcore instead of copying its plasticity (ie its sonic palette ). The essence of Hardcore, the clash between electronic music and Jamaican sound system culture, boils down to these things, in my opinion: the constant search for the new, musical hybridity, and _rudeness _(beats that focus on the groove, drums and subbass, with a sense of _rudebwoy _swagger).\n\nSo, with end of the year 2018 in sight, I thought I'd make a list of some of my favourite mixes and sets that reflect on what the Hardcore sound _currently _is. When it comes to electronic music, all of these end-year lists by music publications have one fault, in that they focus largely on the traditional rockist formats of albums and EPs (Hip Hop mixtapes too, since they adhere to this traditional presentation). If mixes are included, they are usually official releases from the bigger labels (eg the Fabric series, the Berghain series, etc). Club/Rave music (including Hardcore, of course) is anything but traditional.\n\nWhile the rockist tradition instills all of the praise on the producer, it omits the fact that the DJ is the driving force of this music. The mix is its beating heart. The mix is why the producer makes the music to begin with. The Hardcore culture's soul can be found at the club, online radio sets and podcasts (or on pirate radio if we go back 20 years). Because of the fact that these venues are unofficial, underground and more relaxed, they encourage spontaneity and maybe even the inclusion of remixes that might be insanely difficult or too costly to clear for official mix CDs. After about eight years of listening to electronic music, I finally understand that.\n\nSo let's get on with the list!\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Batu - Live @ P13 x Timedance 24.02.18\" iframe={<iframe allow=\"autoplay\" frameborder=\"no\" height=\"166\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/416037318&amp;color=%23ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true\" width=\"100%\"></iframe>} />\n\nAt the start of this year, I felt as if everything was kind of a mess. Not that it actually was, but I felt as though the underground scene of UK bass music was so wide, comprised of various micro-scenes that formed as quickly as they dissolved, as to be confusing and impenetrable. Because of the Internet, the \"UK\" sound isn't just in the UK anymore, as artists from the US, Canada, Mexico, France, and Australia gravitate towards the UK's particular vibe, if you will. And I couldn't make sense of it. But Bristol's Batu made it make sense.\n\nAt the beginning of the year, he graced us with this live recording of his set from a club night organized by the Timedance label. Through his careful selection, this mix goes from Techno, to rhythmic Dub Techno, to Tribal-like and Vogue beats, to Gqom, to Breakbeat Techno and other bass and drum heavy genreless, leftfield _riddims_. Yet it stays cohesive. And it shows how all of this current UK (and UK-influenced) bass music is sort of _the same thing_, in that, yes, people are bringing their own styles to the table, but there's a similar thread through it all, because almost everyone shares the same, or similar, musical influences, staying between 120 and 130 bpm. In fact, I believe that we might be in a similar context to, say, 2002-2004, when Dubstep and Grime were taking shape within the same equally confusing musical diaspora of UK Garage offshoots (I talk about this in an [early article](https://www.thenextgroove.site/article/20181123_uk-techno-bass-percussion-bass-hard-drums-the-new-hardcore)).Will new genres subsequently emerge? Who knows.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"NKC - 100% NKC Productions Mix for NoFile on Noods Radio - 22nd September 2018\" iframe={<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" allow=\"autoplay\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/505642275&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true\"></iframe>} />\n\nThis is the year in which I also began to appreciate a new sound, related to the UK Techno sound that Batu brings in the above mix - Hard Drum. This mix, a 100% Productions mix from NKC for his show on Bristol's Noods Radio, is the one responsible for this new found appreciation. Hard Drum, as the name implies, is anything but subtle.  It's hot and heavy underground sound system music with prominent percussion, using Afro-ish, wooden percussion. The most prominent influences are UK Funky, Tribal House and Gqom, with some Techno and American bass music sprinkled on there. Imagine futuristic, techy, metallic, bass-heavy Soca and Samba Carnival instrumentals.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Akito - 2nd November 2018 (NTS Radio)\" iframe={<iframe width=\"100%\" height=\"120\" src=\"https://www.mixcloud.com/widget/iframe/?hide_cover=1&light=1&feed=%2FNTSRadio%2Fakito-2nd-november-2018%2F\" frameborder=\"0\" ></iframe>} />\n\nLondon's Akito is another practitioner of Hard Drum. And only since recently. Head of the Sans Absence label, he began focusing on UK Funky sounds, but has gradually shifted towards this current sound, somewhat confirming the lineage between UK Funky and Hard Drum. I was going to include one of his previous sets from his show on NTS Radio, but this one had to take its place after my first listen. Both selection and mixing are on point, as he offers an hour-long assault of percussive bass music.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"RNBWS - Resonance #130 (10.02.2018)\" iframe={<iframe allow=\"autoplay\" frameborder=\"no\" height=\"166\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/399447219&amp;color=%23ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true\" width=\"100%\"></iframe>} />\n\nI first came across RNBWS (pronounced \"rainbows\"), a Moscow-based DJ and producer, listening to his [great EP](https://soundcloud.com/bunkaudio/sets/rnbws-apnoea-bunk011) on the Manchester-based label, Bunk Audio. Although he himself is based in Russia, his sound is unmistakably UK-inspired. Like NKC, he offers a mix composed entirely of his own productions for the Resonance Moscow radio station. The sound? - UK Techno à la Batu: Stripped back Electro-influenced, syncopated beats and muscular 4x4 Techno backed up by a heavy sine wave bass.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Kamikaze Space Programme - TNDB-podcast 04\" iframe={<iframe allow=\"autoplay\" frameborder=\"no\" height=\"166\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/463401891&amp;color=%23ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true\" width=\"100%\"></iframe>} />\n\nKamikaze Space Programme has his origins in Drum n Bass under the Raiden name. In the early part of this decade, his interests turned to Techno, making a brand of bass-heavy Techno that used his same sonic palette from his DnB days, giving it an Industrial-like vibe, at times. This particular mix sees him interchange between dubby, stripped-back UK Techno (à la Livity Sound and Timedance) to harder, Industrial Techno, with lots of beats using distorted percussion. \n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Henry Greenleaf - Reprezent Radio Takeover\" iframe={<iframe allow=\"autoplay\" frameborder=\"no\" height=\"166\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/528774642&amp;color=%23ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true\" width=\"100%\"></iframe>} />\n\n_\\*his set starts at around 1:06:00_\n\nAnother DnB alumni that has found himself in the deeper ends of today's UK Techno scene. Henry Greenleaf's own production takes much influence from the more recent Swamp 81 sound: stripped back, space and bass _riddims _that recall early Dubstep. This mix, composed entirely of unreleased dubplates from various producers, takes a more _percussively _livelier route by its 2nd half, and shows how seemingly disparate styles going on now actually fit together\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Slimzee vs. Boylan - 1st July 2018 (Rinse FM)\" iframe={<iframe allow=\"autoplay\" frameborder=\"no\" height=\"166\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/466021572&amp;color=%23ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true\" width=\"100%\"></iframe>} />\n\nLet's go into the 140 bpm realm with a back 2 back set by Slimzee and Boylan for Rinse FM. As early as 2001-2, Slimzee's selection of underground, raw, aggressive UK Garage  beats with the Pay As U Go Cartel massively helped define what would be known as Grime. By the mid 2000s, however, seeing the Grime scene become almost entirely MC-centric, he laid low until making his comeback behind the decks some five years ago now. This set, with new player Boylan, is comprised of more ravey Grime beats that don't necessarily cater to MCs. On the Grime subreddit, I read someone describe Slimzee's current selection as \"_anxiety inducing_\". Take note, the beats in this set can be intense.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Bell Curve - Footwoork Jungle Mix Series 054\" iframe={<iframe allow=\"autoplay\" frameborder=\"no\" height=\"166\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/538836972&amp;color=%23ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true\" width=\"100%\"></iframe>} />\n\nLet's speed things up a little more.  New York's Bell Curve serves up a great mix of high velocity bass music for The Footwork Jungle. Like the A.Fruit mix that I shared in my DnB and Jungle post, her sound can't be honed into one specific genre, typical in the current era of open-ended music tastes and \"anything goes\" approach. But it all holds together, as she takes us from one futuristic _riddim _to another, going into old school-inspired sounds from time to time. Great things are happening in the Jungle/DnB space right now and this mix is a further testament to that.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Vromm - CBR Podcast 03\" iframe={<iframe allow=\"autoplay\" frameborder=\"no\" height=\"166\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/461353497&amp;color=%23ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true\" width=\"100%\"></iframe>} />\n\nVromm's entry for the Cosmic Bridge podcast makes a second appearance into one of my playlists. I had to include it here. Released earlier in the year, this mix, along with the **Street Beats Vol. 2** compilation, gave me a rekindled interest in DnB. The vibe of this music presented here gives off a Dreamscape vibe, from the early to mid 90s, but it stays entirely modern and sounds \"current\", if you will, making use of more modern approaches to beat patterns (ie the halftime beat).\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Patrick Flint - Mix for Elise (Rinse France)\" iframe={<iframe allow=\"autoplay\" frameborder=\"no\" height=\"166\" scrolling=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/522131337&amp;color=%23ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;show_teaser=true\" width=\"100%\"></iframe>} />\n\nAnd to finish this list, another recent find, both the mix and the artist. In Patrick Flint's \"[Lean In](https://www.youtube.com/watch?v=5Wr711NIZdA)\", I heard one of my favourite UK Techno tracks of the year. As that particular one would suggest, the mix mostly stays in the more dubbier end of current UK Techno (think of the recent releases from Livity Sound) but ramps up considerably in energy as it nears the end. Lots of great subbass heavy, syncopated beats are found here."
}