{
  "publicationDate": "Aug 03, 2018",
  "title": "20 Years Later : Massive Attack - Mezzanine",
  "mainImage": "/cms-content/uploads/massive-attack.jpg",
  "category": "MUSINGS",
  "summary": "Mezzanine turned 20 this year, and it's still as excellent as ever. I look back at one the first electronic albums I've loved, and see where it stands today.",
  "body": "I remember, oh about 11 or 12 years ago, when I had just taken the plunge into the world of music geekdom, reading reviews and articles,  and seeking out new artists and albums to add on my endless \"to listen\" list, I had noticed that this album was often mentioned as a landmark work from the 90s. Admittedly, I also remember ignoring it for the simple fact that the cover put me off (and I still stand by my opinion that it is an ugly cover). But after listening to DJ Shadow's renowned _Endtroducing _(and loving it), and upon further reading, I learned that _Mezzanine _is regarded as one of the three masterpieces of the Trip-Hop genre (with Portishead's Dummy completing the trio).\n\nMezzanine was definitely a grower. At just over the hour-long mark, it was then one of the longest albums I had listened to. It's essentially an hour-long listen of slow-tempo'd tracks, with most of them taking their time to build. And I had not yet developed the patience as a listener that I have today. However, right off the bat, there was no denying the strength of the first four tracks. Angel, especially, remains one of the most memorable openers: the ominous-yet-sexy bassline and riff,  the reverent vocals singing \"You are my angel/Come from way above/To bring me love\", and the rock-out crescendo are hard to forget.\n\n![](/cms-content/uploads/massive-attack-2.jpg)\n\nThere is an undeniable sensuality to the music, what with the slow, prominent basslines, the sleazy riffs, the whispered male vocals and the soft, angelic female vocals. There's a heavy sense of desire, of fulfilled and unfulfilled love and intimacy. But the brooding bass and the dubwise effects give this album some sense of claustrophobia and dread underlying the lyricism, itself revolving around the themes of love, self-awareness, self-doubt, alienation and deception:\n\n<SpecialText align=\"CENTER\" size=\"NORMAL\" />\n\n_\"I need a little love to ease the pain_\n\n<SpecialText align=\"CENTER\" size=\"NORMAL\" />\n\n_You're not my savior, but I still won't go_\n\n<SpecialText align=\"CENTER\" size=\"NORMAL\" />\n\n_I could fake it, but I still want more_\n\nFor my money, Mezzanine is still an exceptional album, but where does it stand now, 20 years later? Where does it fit in the pantheon of electronic music, that has flourished exponentially this last decade?\n\nI feel like it has since been overshadowed by Burial's early work, which showcases a blend of the bass dread from Croydon-era Dubstep, with the melancholic vocal samples manipulated like those in a Todd Edwards record - a combination which seems to resonate more with today's young generation. Even though Massive Attack's music shares some fundamental elements with that of Burial's (namely, the Dub Reggae influence and the melancholic vibe), the latter is able to exert the cathartic reverberations of dance music and the UK rave music sound. This, I think, is more in line with today's tastes. What's more, I think that younger listeners are more interested in discovering House, Techno, Jungle, Garage, etc, from the 90s than to listen to the rockist canon of album-oriented, \"acceptable\" electronic music that has, at this point, little new to offer.  \n\nNotably, Mezzanine is regarded as the last great Trip-Hop album. I've even read people calling this the final nail in the coffin for the genre. Because, the sentiment goes:_ how do you top this? _ And even though there have been new Trip-Hop acts that have sprung up in the new millennium, the genre remains attached to the 90s in the general consciousness (like Grunge is). In the mid-2000s, I think people still had hope that the genre would make a comeback, based on the strength of this, Tricky's and Portihead's works. It never did, of course.\n\n![](/cms-content/uploads/massive-attack-3.jpg)\n\nMassive Attack did eventually make a comeback after a long hiatus. However, they have never been able to match this album. The music in this album has ambition, but it is never too ostentatious in its production tricks. This approach has permitted it to age gracefully. If this album sounds like a 90s album, it's because the Trip-Hop sound happens to be heavily influenced by Boom Bap (even then, only in regards to drum programming). Lastly,  its strength lies simply in its memorable songwriting. It might take a little patience to soak it in, but once the music grabs you, it never really lets go. I listen to it maybe once every two years now, but I'd be lying if I said that bits and pieces of this album don't pop into my head every now and then.\n\n__"
}