{
  "publicationDate": "Sep 18, 2018",
  "title": "Don Robbie's Crucial Past: Sniffing Our Way Into UK Reggae.",
  "mainImage": "/cms-content/uploads/robbie.jpg",
  "category": "PLAYLISTS",
  "summary": "We should have known that Don Robbie from AFTV was a real badman. His days as the Crucial Robbie reminds us that the UK has had a rich Reggae scene for a while.",
  "body": "As with many people who follow the Premier League, Arsenal's disappointing last four seasons have led me to discover AFTV (previously Arsenal Fan TV). Set up by Robbie Lyle in 2012, \"for the fans by the fans\", AFTV's intention was to give a venue where the disgruntled fans could speak their minds, ranting about the manager Arsène Wenger and his antiquated tactics, and the inconsistent showing from the players. The prestigious team's downward slope culminated last year with their 6th placed finish (they usually finish in the coveted top 4) and trophy-less season; their worst result in the 22 years that Wenger coached Arsenal, seeing him end his gig at the London club.\n\nIn all the highs and lows of the team, after every single game, week in and week out, whether they're playing in their home-base of North London or someplace in the Ukraine you never knew existed, Robbie shows up with his camera and his microphone at hand to interview the fans and let them express their elated joy or their continued despair.\n\nAnd for better or for worse, some charismatic interviewees became regulars on the channel; ordinary folks ranting about their team and manager, sometimes in an unintended comical fashion as with Troopz (the channel's nickname is BludFamTV because of his rants). These rants have attracted people from all over, transcending the Arsenal fanbase, to savour the _schadenfreude _or to simply be entertained.\n\n<EmbeddedMusic title=\"AFTV - Best of Troopz and DT\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/KQkzXNrPyTU?start=58\" width=\"560\"></iframe>} />\n\nAnd Robbie is always there to document it. Not only those \"characters\", but also to get the opinion of other \"more sensible, reasonable\" fans. His work has earned him over 800k subscribers, making his channel by far the biggest football/soccer fan channel on Youtube. It has recently caught the attention of professional pundits and he's been invited to talk on TV and on other Youtube channels.\n\nAnd if the Youtube comment sections are to be believed, Robbie, racking in the money after every loss because of the funnier interviews which generate more views, owns everything now. Every stadium, every building, every parc, every monument (from whichever country) that are used as backdrops for his videos are apparently his. Really, it's just a playful way to express how much success he's had. That's why he's the Don. Don Robbie.\n\nHowever, about a year ago, someone unearthed some old concert footage featuring a familiar face. Well, it appears that before Don Robbie, in his days of yore, he was the reggae artist, the badman, the rudebwoy, the sound murderer, **Crucial Robbie**.\n\n<EmbeddedMusic title=\"Crucial Robbie - Don't Sniff the Coke (Live)\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/TDonpQ4tUkM\" width=\"560\"></iframe><br />} />\n\nAnd to my, and certainly others', great delight, I found out that he had released an LP of Digi Reggae, _Crucial View_, released way back in 1990. While it's lacking his rediscovered hit,[ Don't Sniff the Coke](https://www.youtube.com/watch?v=KAUpBMG1iPA) (\\*sniff, sniff\\*), the album is a pretty solid work from the Casio keyboard-era of Dancehall.\n\nSo, if you're up for it, I feel that we could take this opportunity to dig a little further into UK Reggae. We've heard the Don in action on the mic, so let's have a look at other artists. I won't pretend to be an expert, but I thought I'd share some tunes I've enjoyed and discovered while listening to some of The Heatwave's and the Toast Collective radio shows. Don Robbie clearly says not to sniff the coke, so we won't. But I think we should take strong sniffs into UK Reggae. Robbie sniffs six times in his chorus. So we'll also take six sniffs. One song per sniff. Six sniffs. Six Songs.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n_\\*sniff\\*\n_\n\nOur first hit will be a dose of the UK Apachi's **No Poll Tax**. Yes, this is _the _Apachi, who would become the Ragga Jungle hero. Released in 1990 on Sweet Freedom Records.\n\n<EmbeddedMusic title=\"UK Apachi - No Poll Tax\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"266\" src=\"https://www.youtube.com/embed/ApMttEqX0EE\" width=\"560\"></iframe>} />\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n\\*sniff\\*\n\nOur second hit is courtesy of another Jungle legend. Prior to his raving days, General Levy also dabbled in Dancehall. His 1988 track, **New Cockatoo**, already displays his unique vocal delivery that would make him popular.\n\n<EmbeddedMusic title=\"General Levy - New Cockatoo\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"266\" src=\"https://www.youtube.com/embed/_jK7CIE5VeA\" width=\"560\"></iframe>} />\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n_\\*sniff\\*\n_\n\nThe third hit gives a taste of Top Cat's** Push Up Yu Lighter**. The 1992 track seems to be a flip of the mega-hit \"Under Mi Sleng Teng\" riddim.\n\n<EmbeddedMusic title=\"Top Cat - Push Up Yu Lighter\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"266\" src=\"https://www.youtube.com/embed/zz_CN-PNhzg\" width=\"560\"></iframe>} />\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n_\\*SNIFFFFF\\*\n_\n\nOur fourth hit is a strong one, fast-forwarding us all the way to the late 2000s. Producer DJ NG teams up with MC Versatile and future UK star and rave queen Katy B, in one of her first records. **Tell Me**, blending UK Garage with Carribean rhythms, is not only one of Katy B's best performances, but it was also very influential in shaping the UK Funky genre.\n\n<EmbeddedMusic title=\"DJ NG feat Katy B & Versatile - Tell Me\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"266\" src=\"https://www.youtube.com/embed/s7tKPPsXawA\" width=\"560\"></iframe>} />\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n_\\*sniff\\*\n_\n\nOur penultimate hit takes us to Lea-Anna. The forgotten UK singer brought us one of the biggest dancehall hits of 2012 with **Murder**.\n\n<EmbeddedMusic title=\"Lea-Anna - Murder\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"266\" src=\"https://www.youtube.com/embed/c2VsDPs61aw\" width=\"560\"></iframe>} />\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n\\*sniffffff\\*\n\nFinally, our last hit will be Stefflon Don's Afroswing track,** Envy Us**. Taking rhythm inspiration from the Afrobeats genre, the song is a great showcase as to why she's become one of the biggest UK Dancehall perfomers as of late.\n\n<EmbeddedMusic title=\"Stefflon Don feat. Abra Cadabra - Envy Us\" iframe={<iframe allow=\"autoplay; encrypted-media\" allowfullscreen=\"\" frameborder=\"0\" height=\"266\" src=\"https://www.youtube.com/embed/dnVdUTlIlgE\" width=\"560\"></iframe>} />"
}