{
  "publicationDate": "Mar 10, 2019",
  "title": "Deep Skanking - Dubstep's Digitized Roots",
  "mainImage": "/cms-content/uploads/title-image-compressed.png",
  "category": "PLAYLISTS",
  "summary": "I briefly talk about dubstep's sonic origins and share the playlist in which I collected \"proto-dubstep\" tracks available to stream on Spotify and Google Play. ",
  "body": "O the glory days of Grooveshark. When I started to get into electronic music (around 2010 ) and dove straight into my first genre of choice, dubstep, Grooveshark was all I needed to embark on my deep exploration. You see, I discovered the genre mainly through the site: listening to all the classic stuff from the Digital Mystikz and Loefah; as well as everything from the classic labels such as Tectonic, Hotflush, Tempa, Dub Soldiers, Chestplate, DMZ; and on top of that, the influential mixes like the first two _Dubstep Allstars_ volumes, Skream's entry for _Watch the Ride_, and Caspa & Rusko's _Fabriclive 37_. It was all there.\n\nAfter it inevitably closed down, we've had to contend ourselves with a decentralized experience of listening to music: from Youtube, to Bandcamp, and Soundcloud; then on Spotify, Google Music, Deezer, or Tidal; and finally maybe on Beatport. And if all these options fail you in finding what you're looking for, well, you have to take up crime and look into unofficial venues. It truly leaves a sour taste in the mouth because Grooveshark proved that the technology and means are there to centralize music. Oh well.\n\nDiscovering electronic club music from before 2008 (ish) can sometimes be quite a hassle and lead to frustration. When it comes to club music (house, techno, dnb, jungle, garage, trance, etc, etc), most of it from before that year came out as singles or EPs on vinyl. If we aren't willing to shell out the money (prices go up fast with shipping fees), we have to hope that someone has uploaded a rip on Youtube or that a label has released digital versions of their backlog. Thankfully, both music collectors and labels have been hard at work this past decade,  so the gaps are receding.\n\nAll this rambling leads me to the point: I've recently made a playlist, available on both [Spotify ](https://open.spotify.com/playlist/7AIeV1cAXEgG06uclrjJ3V)and [Google Music](https://play.google.com/music/playlist/AMaBXylEBAUu0Rl4TVzG75VzPKEWCCewMV4E2SiE-NdwvHe5L4RLqRus9QLgZRQiqjU01RbXoHED4zZPHLbwCeRQzLmGLo6MOw%3D%3D), that shares the same name as this article, _Deep Skanking: Dubstep's Digitized Roots_. By  “dubstep's roots” here, I don't mean the classic 2004-7ish material that I listed up top, but the pre-2004 music that shaped what eventually became what we now recognize as “dubstep”; back when the scene was centered around the “FWD>>” (pronounced “forward”) club night in London. \n\nMy goal for this playlist was to be able to listen as much of as I could in one place. This idea sprang to my mind when I was  skimming through Beatport and noticed that DJ Zinc had released his seminal proto-grime/proto-dubstep track “138 Trek” (from 2000) in digital format on streaming platforms, as well as all the stuff from his Bingo Beats label. And shortly after, I realized that Locked On, an influential proto-dubstep label coming from a UK Garage standpoint, had also made its releases from the early 2000s available for streaming.\n\nDubstep didn't come out of a vacuum. In my [Dubstep Allstars retrospective](https://www.thenextgroove.site/article/20181124_a-look-back-dubstep-allstars-a-movement-takes-shape), I wrote about the two DJs, Hatcha and Youngsta, who were the most influential in shaping the South London sound of “140bpm bass music”, that we know as old school dubstep. However, from 2000 (ish) to 2004, there was a whole scene around them (however small it was in the grand scheme of things). The established grand narrative of dubstep would have you think that, before 2004,  everyone was playing the same tracks from the same people (namely El-B, Horsepower Productions, Zed Bias, Skream, Benga, Artwork). But that is an incomplete story of dubstep's origins. (the complete story is beyond the scope of this entry and my knowledge)\n\nNow, I wasn't there, so both my knowledge and my selection for this playlist are strictly based on old sets, nostalgia sets, interviews and blog posts. The important thing to understand is that, like the beginning of every genre, there wasn't yet a clear-cut, defined “genre”. FWD's mission wasn't to invent a new one either; it was simply to promote underground club music. In this case, due to the era in which it started, that largely meant underground 2-step/UK Garage. But there we only so many garage tracks that fit the criteria. So DJs had to get creative with their selection, look outside of the genre to find tracks that would fit with the club night's overall vibe. Look into future jazz, broken beat techno, breaks, and maybe some electro; and even 8-bar and eski beat – both being early iterations of grime. And the sound progressed, incubating within this small scene, with all of those sounds being part of its DNA. As it went along, there was a focus on making it \"darker\".\n\nAt the end of the day, it was about playing “deep” sounds. Informed by “garridge music”, but not strictly “garridge”. Deep sounds, as opposed to the poppier vibe that the genre had been shifting into, like Wookie and Selena's syrupy strings in “[Give it Up](https://www.youtube.com/watch?v=qdiO53Cvjro)”, MJ Cole's soul-tinged “[Sincere](https://www.youtube.com/watch?v=02KRAshCG0w)” and So Solid Crew's bling-bling style with their “[Sentimental Things (Oh No)](https://www.youtube.com/watch?v=guJ0NyQVs9I)”.\n\nCompare those with Marcus Intalex and ST Files's “Taking Over Me”, which initiates the playlist. It's a house track, through and through, but its rollings breaks and atmospheric synths were a great fit for FWD, something that, for example, Blackdown would use to pad out his sets (as he explains in this great[ blog post](http://blackdownsoundboy.blogspot.com/2018/12/roots-of-reflections.html)).\n\nThe obvious players are almost all here (again, those whose music is available to stream): El-B, Zed Bias (Phturistix, Maddslinky, E.S. Dubs) and Horsepower Productions. But let's not forget the ultra-minimalist and raw 8-bar sounds of Big$hot, Youngstar and Corporation of London, whose beats were made for MCs but that could blend well with Horsepower Productions' “tribal garage” (“Fat Larry's Skank”) or Zed Bias' heavy fusion of future jazz and garage (e.g. “Reject”, \"551 Blues\"). Let's also not forget Ms Dynamite's bashment/garage collabs with Oris Jay/Darwqwan (“Test Dis”), Menta (“Ramp”) or Sticky (Booo!) that could go well beside Nubian Mindz' heavy broken beat techno, or beside DJ Zinc/Jammin's brand of “breakstep” that he pushed with his Bingo Beats label. Etc, Etc,.\n\n There are some glaring holes though. Tempa hasn't made most of its pre-2005 backlog available for streaming, and neither have its affiliated labels (ShelfLife, Soulja and Road). Big Apple Records, another influential South London label, which promoted Skream, Benga, Loefah, and the Digital Mystikz, has closed shop a while ago and their releases have remained vinyl-only. Also missing for streaming are the releases from Texture Records, which focused on the “breaks” side of the “140 scene”, and became more aggro as it went on. Finally, all of the early white-label grime releases are obviously missing, notably the material from Jon E Cash and DJ Wonder whose approach with skeletal production and sub-bass overload very much informed what became \"dubstep\".\n\nNevertheless, the 60+ tracks I've compiled (taken from various re-releases and compilations) should give you a pretty good idea of where the genre came from, _sonically_. One last thing I'd like to point out regarding the playlist: the last six tracks are “proper dubstep”, ranging from 2004 to 2008. These were selected to include the five South London producers who were the favourites of Hatcha and Younga (D1, Loefah, Mala, Benga, Coki) and also to have different styles, which is why I chose Distance's “Tropical Rub”, whose aggro vibe is a precursor to what would become the “brostep” sound (that “filthy”, aggressive, wub wub, “drop it like a B0:55” style that became popular around the world in the early 2010s). We have Loefah's dread-filled beats, Mala's meditative dub-rasta deepness, Benga and Coki's preference for more bouncy, ravey riddims, and, lastly, Skream's “Hedd Banger” which showcases the classic, dark and deep halfstep style. The 62 preceding tracks should let you be able to further contextualize them musically.\n\n_I've assembled the tracks in chronological order, then organized them in alphabetical order (according to artist names) within their year of release. This was done to make it much simpler for me, so there's no “flow” that I tried to establish. At 6+ hours, this isn't really a playlist that you'd listen in one sitting. Whether you want to skim through it or listen in multiple sessions, is up to each listener, obviously._\n\n[SPOTIFY PLAYLIST LINK](https://open.spotify.com/playlist/7AIeV1cAXEgG06uclrjJ3V)\n\n[GOOGLE PLAYLIST LINK](https://play.google.com/music/playlist/AMaBXylEBAUu0Rl4TVzG75VzPKEWCCewMV4E2SiE-NdwvHe5L4RLqRus9QLgZRQiqjU01RbXoHED4zZPHLbwCeRQzLmGLo6MOw%3D%3D)\n\nTracklist:\n\n2000\n\nMarcus Intalex + S.T. Files ‎– Taking Over Me \\[Hospital Records]\n\nDJ Zinc – 138 Trek \\[Phaze:one]\n\nDavid Howard – U & I (Phuturistix Dub) \\[Locked On]\n\nDJ Dee Kline – I Don't Smoke (Original Mix) \\[EastWest]\n\nEl-B – Digital (Original Mix) \\[Locked On]\n\nHorsepower Productions – When You Hold Me \\[Tempa]\n\nJammin' – Hold On  & Distraction \\[Bingo Beats]\n\nLandslide – Incurable Voices \\[Hospital Records]\n\nNubian Minds – Old Lies \\[Archive]\n\nPhuturistix – Ready \\[Locked On]\n\nSuburban Lick – Here Come the Lick (DJ South Central Remix) \\[Locked On]\n\nRuff Cut Bias – Down (Dub Mix) \\[Locked On]\n\nTallisman – Bad Blood (Large Joints Remix) \\[Locked On]\n\nThe Wideboys – Something's Got Me Started (Wideboys Dub) \\[Locked On]\n\n**2001\n:**\n\nBenny Ill, Kode9, The Culprit – Fat Larry's Skank \\[Tempa]\n\nBig$hot – Stomp \\[Southside Recordings]\n\nE.S. Dubs – Soul Drain \\[Locked On]\n\nHorsepower Productions- Fist of Fury \\[Tempa]\n\nHorsepower Productions- Boogaloo \\[Tempa]\n\nJammin' – Kinda Funky \\[Bingo Beats]\n\nJammin' – Go DJ / Dirty \\[Bingo Beats]\n\nJammin' –  Unstable \\[Bingo Beats]\n\nLandslide – Hear My People (Dub) \\[Hospital Records]\n\nMaddslinky – Reject / Desert Fog \\[Sirkus]\n\nMaddslinky – Future Chicano \\[Sirkus]\n\nOris Jay feat. Ms Dynamite – Test Dis \\[-]\n\nPhuturistix – Deepdown EP \\[Locked On]\n\nSticky feat. Ms Dynamite – Booo! \\[FFRR]\n\nWookie – Storm / Stargate \\[Manchu Recordings]\n\nJammin' – Kinda Funky (Wookie Remix) \\[Bingo Beats]\n\nExemen (Wookie) – Far East / Duppy  \\[Manchu Recordings]\n\n**2002\n:**\n\nCorporation of London – Roar Beats / Beatz \\[Locked On]\n\nGhost (El-B prod) – Buck & Bury \\[Ghost]\n\nHi Grade – Brockout \\[Bingo Beats]\n\nHorsepower Productions – What We Do (Original Mix) / Midnight Tease (Instrumental) \\[Tempa]\n\nJammin' – As We Do \\[Bingo Beats]\n\nMs Dynamite & Menta – Ramp \\[Biggerbeats Records]\n\nSirus – Grouch (Original Mix) \\[Harry Lime]\n\nWiley – Eskimo \\[Wiley Kat Records]\n\nWookie – Loco \\[Manchu Recordings]\n\nYoungstar – The Formula \\[DDJs Productions]\n\n**2003\n:**\n\nCorporation of London – Funky Shit / Chuckles \\[Locked On]\n\nDub Child – Roll Dat Shit \\[Storming Productions]\n\nHigh Plains Drifter Feat. Goldspot Productions, NYC Sholay (Epic Mix) \\[Tempa]\n\nHorsepower Productions – Landslide Remix \\[Tempa]\n\nJammin' -  Tonka (Menta Remix) \\[Bingo Beats]\n\nMacabre Unit – Dem Na Ready \\[-]\n\nPlasticman (Plastician) – Venom \\[Slimzos Recordings]\n\nPlasticman – Hard Graft* \\[Road] ←spotify\n (to replace \"Ambush\")\n\nWarlock – Silence is Defeat \\[Rag & Bone]\n\nWookie – Jaguar \\[Manchu Recordings]\n\nYoungstar – Dimension X \\[DDJs Productions]\n\n116 – Ambush* \\[DDJs Productions] ← google\n (not available on spotify)\n\n** \n\"Dubstep\":**\n\nD1 – Crack Bong \\[Tempa]\n\nLoefah – Truly Dread \\[Tempa]\n\nDistance – Tropical Rub \\[Sting Recordings]\n\nDigital Mystikz – Give Jah Glory (Mala production) \\[Tempa]\n\nBenga & Coki – Night \\[Tempa]\n\nSkream – Hedd Banger \\[Tectonic]"
}