{
  "publicationDate": "May 18, 2019",
  "title": "Imperial Selection",
  "mainImage": "/cms-content/uploads/title-image-feast.png",
  "category": "MUSINGS",
  "summary": "Some quick thoughts, and going through my fave mixes and sets from the past few weeks.",
  "body": "I don't know what happened. I don't know if everyone was particularly inspired during these past few weeks or that maybe I was particularly receptive, but a lot of damn good mixes and sets came out, and it's the first time I've cut some out. I meant to make this list a week before, but I got too caught up doing the D1 thing, which turned out to be longer than I had initially anticipated. \n\nI honestly don't have much commentary to make for this entry. As much good music as there was since my last list, there wasn't anything that came to mind as to the direction the music is going (or the lack thereof in this web 2.0-era of music experience). All I can say is: as we draw closer to the end of another decade, I've come to terms with the fact that we didn't witness the birth of a “big” new genre that would seem to captivate everyone at once. There's too much music-discovery-as-personal-experience, too much looking back, too much choice at any given moment for it to happen in electronic music right now\n\nWave? Future Bass? Gqom? Deconstructed Club? The latter has been using too many samples of movie effects and shattered drinking glasses, and become too _auteur­_-iste to be taken seriously outside of the “music geek”-sphere. (You need to attract the “non-artists”, the “anti-artist”, to drive in that heavy surge of “innocent” creativity, not just from the artsy crowd). Wave seemed incredibly uninspired the moment it was invented (in my experience, that would be around 2012-3; basically an offshoot of the dullest trap-influenced grime beats that Plastician was playing on his Rinse show at the time), but I've noticed that it's slowly (see:slowly) been picking up steam. The gqom originators have watered down their sound since the likes of mixmag accepted them into their ranks. That isn't intrinsically bad (in fact, I love some of the new stuff), but this has resulted in it being sucked into the global blob of afro/global bass/club  in the general consciousness.\n\nAnd what about juke? Well, I really like it, and I like that it's gotten a resurgence of interest lately with the “160” scene, but it didn't end up causing the disruption I hoped it would back in 2010.\n\nYep, this really was hip hop's decade. Hip hop is what gave us something close to \"new, visceral music as a collective experience”, starting with the whole mixtape-era of Atlanta trap and Chicago drill (and bop, to an extent), and going into the Future and Young Thug sound of autotuned alien-gangster stuff.  Kendrick Lamar's _To Pimp a Butterfly_ is probably the only album in these 10 years that has brought together an intersection of geeks, casual listeners, old hip hop heads and younger ones (Kanye's _Fantasy_ too, maybe). And some have been saying that UK drill is the genre currently channeling the energy of old school hardcore and jungle'(as opposed to the UK techno/bass and deconstructed club stuff).\n\nOk, maybe I had a thing or two to say. I'll stop there. \n\nDespite all this, the quality is still there. And this is what I think was the most exciting in mixes and sets since my last list. I'll start things off with the three must-listens.\n\nFirstly, a mix from March that I had missed. I would like to confirm that yes, DJ Stingray's Essential Mix is just as good as people have been saying. One of Europe's current Detroit ambassadors gives us essentially two hours of electro and techno slappers, showing us that there's still some goddamn funk left in Berlin. \n\n<EmbeddedMusic title=\"DJ Stingray - BBC Radio 1 Essential Mix (02-03-2019)\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/qmjniDKIA1Q\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\n//\n\nFor some more dirty electro bidness, Galaxian, one of Stingray's past collaborators, gave the Hong Kong Community Radio a hell of a set - an intergalactic blast, a cosmic fuckfest, apocalypse-as-enlightenment, bass designed to mess up your insides. (check out his [incredible release](https://www.youtube.com/watch?v=71k8xhbSUL4) from this year)\n\n<EmbeddedMusic title=\"Galaxian - 19/4/2019 (HKCR)\" iframe={<iframe width=\"100%\" height=\"120\" src=\"https://www.mixcloud.com/widget/iframe/?hide_cover=1&feed=%2FHKCR%2Fgalaxian-1942019%2F\" frameborder=\"0\" ></iframe>} />\n\n//\n\nTo switch things up a bit (but not dial down in energy), Akito and Noire's set for NTS Radio in April. The Sans Absence label boss Akito, based in London, is doing everything right with his “percussively-focused club music” - or  “hard drum” as some might call. Or maybe “turbo funky” as I'd call it (stealing Fracture's “turbo dnb” term). I don't know what it's called, but this heavy, rave-y carnaval sound will make you want to slap ya mom up. Well, I'm mostly just glad that I'm getting into a new UK sound that has stepped out of the “dubstep synthesis” of UK bass, and that isn't treading water.\n\n<EmbeddedMusic title=\"Akito - 5th April 2019\" iframe={<iframe width=\"100%\" height=\"120\" src=\"https://www.mixcloud.com/widget/iframe/?hide_cover=1&feed=%2FNTSRadio%2Fakito-5th-april-2019%2F\" frameborder=\"0\" ></iframe>} />\n\n//\n\nSpeaking of “dubstep synthesis”, Henry Greenleaf's mix for Body Promise deserves an honorable mention amongst the previous three. While his peers are going more into leftfield or conventional-techno territories, the former dnb producer is holding it down with his style of UK techno that sometimes veers close to techno-via-hatcha-circa-2004. \n\n<EmbeddedMusic title=\"Henry Greenleaf – Body Promise BP 118\" iframe={<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" allow=\"autoplay\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/602717451&color=%23056ba6&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true\"></iframe>} />\n\n//\n\nFor more of those UK techno vibes, the Famous Eno collaborator from Mexico, Siete Catorce, has also done a mix for JEROME mixfiles on soundcloud. (https://soundcloud.com/jeromemixfileseries/jerome-mixfile-425-siete-catorce )\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\nNow for some dnb/jungle.\n\nRupture London took over Keep Hush at the very end of March. The label has been repping the classic dark rollage dnb sound since its inception, and the Youtube channel has recreated the underground vibes that Boiler Room initially had 10 years ago. The pairing has resulted in incredible sets from Mantra and Mani Festo, both of them effortlessly bringing together the old and the new.\n\n<EmbeddedMusic title=\"Mantra DJ set | Keep Hush Live: Rupture Takeover\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/LIaL7xi_MAM\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\n<EmbeddedMusic title=\"Mani Festo DJ set | Keep Hush Live: Rupture Takeover\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/c-TF41HePaI\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\n//\n\nFor more dark rollage, check out Dom & Roland intense 30-min mix for BBC Radio 1. It's essentially a  promo for his bandcamp page, so check it (https://domandroland.bandcamp.com/ ) out if you can. His new release from April is great – smooth yet heavy. (https://domandroland.bandcamp.com/album/beach-bum-dred-sound )\n\n<EmbeddedMusic title=\"Dom & Roland BBC Radio 1 Guest Mix April 2019\" iframe={<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" allow=\"autoplay\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/603350553&color=%23056ba6&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true\"></iframe>} />\n\n//\n\nKeysound did an “All Vinyl ('94-'98 D&B)” set for their monthly show on Rinse. Expect the classic names like Photek, Doc Scott, Ed Rush & Optical and Krust. (https://soundcloud.com/rinsefm/keysound-25th-april-2019 )\n\n//\n\nSonic Rampage's Pearsall also did a great mix of new school old school, this time focusing on new tracks from artists that imitate the old “darkside” breakbeat and jungle vibe from '93. And he's shared some [great thoughts](http://sonicrampage.org/blog/2019/04/pearsall-presents-get-it-005-get-dark-new-skool-darkside-mix/) on this current retro-rave trend, as well as some [interesting discussion](http://sonicrampage.org/blog/2019/05/more-thoughts-on-get-dark/) from readers/listeners. \n\n<EmbeddedMusic title=\"Pearsall presents Get It 005: Get Dark\" iframe={<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" allow=\"autoplay\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/610333344&color=%23056ba6&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true\"></iframe>} />\n\n//\n\nAnd lastly, for some new new school, definitely check out some “160” stuff that I mentioned, blending halftime, juke and jungle. London-based and Reprezent Radio resident Sherelle has been leading the charge on that front. And she invites Om Unit to provide a guest mix for his take on the sound.\n\n<EmbeddedMusic title=\"Sherelle W/ Om Unit | 16th April 2019\" iframe={<iframe width=\"100%\" height=\"120\" src=\"https://www.mixcloud.com/widget/iframe/?hide_cover=1&feed=%2FReprezent%2Fsherelle-w-om-unit-16th-april-2019%2F\" frameborder=\"0\" ></iframe>} />\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\nAnd lastly lastly, Benny Ill shared a 2 hour-long session of 90s garage  (_garridge_ and _guhrahje_) through his twitter page to celebrate the coming of Spring. I was kind enough to download from his mediafire link and upload on mixcloud, so get this into your system, pronto.\n\n<EmbeddedMusic title=\"BENNY ILL'S GARAGE SPECIAL\" iframe={<iframe width=\"100%\" height=\"120\" src=\"https://www.mixcloud.com/widget/iframe/?hide_cover=1&feed=%2Fmordak%2Fbenny-ills-garage-special%2F\" frameborder=\"0\" ></iframe>} />"
}