{
  "publicationDate": "Mar 19, 2019",
  "title": "Future Bits and Pieces",
  "mainImage": "/cms-content/uploads/cs702073-01a-big.jpg",
  "category": "MUSINGS",
  "summary": "I've go advanced promo copies now, so I go through some upcoming stuff and some unreleased material to see what's on the horizon",
  "body": "Well, I've become my own worst enemy; I'm officially writing reviews for a magazine. In my case case, I've joined the writing team for the \"Frequencies\" section (or \"dance & electronic\" as they otherwise put it) of Exclaim. It's not so much for my prowess in writing (I think), as it is for the fact that I \"look like I know my stuff\". They must be unaware that there are thousands of people on discogs and soundcloud with an infinite amount of knowledge about electronic music, much more than I could hope to achieve in the next, say, 10 years? I take it that my penchant for writing about music already on this blog made me an appealing addition to their team, which was apparently lacking in writers.\n\nWhich means that, now, I have to write about one review a week, for releases of my choosing, without crossing the 300 word limit by too much. So for those roughly 300 words a week, I'm given what is probably the greatest perk in being a reviewer: getting my hands on future records (digital format, of course), sometimes well before their release dates (months, for example).\n\nThat was the case for the inaugural V/A EP of a new Toronto-based label, Parallel Minds, for which I had to write a review at the beginning of February. The EP consists of 4 tracks from Toronto producers: the relatively unknowns Yohei S., Radiant Aura Faculty (aka Raf Reza) and Daniel 58, lead by Ciel, whom you might know from her release Shanti Celeste's Peach Discs label. Her \"Hind Sight is 360\" here, an energetic and dreamy deep house track with 90s Moby vibes, is tied with this year's remix of Ilana Bryne's \"Mmm Mmm Mmm\" for being by far her best work yet. The rest is really solid as well. Listen to samples [here](https://soundcloud.com/weareparallelminds/parallel-minds-vol-1-various-artists?in=cl_lit/sets/parallel-minds-vol-1). It comes out on April 12th (iirc) so my review should be up around that time. \n\nComing out this Friday, which I also reviewed, is Dead Man Chest's new record on Sneaker Social Club. He calls up his \"new school\" old school junglist peeps Sonic, Response and Coco Bryce for some collabs. The Response one is the best of the bunch, unsurprisingly. Last year, Response & Pilkin showed us with their \"Plastic Face / Tangled Up\" that there's still some legs to 150bpm ethereal four-on-the-floor jungle beats à la Dreamscape circa 93. DMC and Response revisit that idea with their \"We All Go a Little Mad Sometimes\".  DMC also explores that sound with the Sonic [collab](https://soundcloud.com/sneakersocialclub/dead-mans-chest-x-sonic-pum-flex-ra-tracks), though to slightly lesser effect. \n\nSpeaking of Sonic, go peep his new LP, _110174, on _Western Lore._ _It beautifully bridges the gap between old school sounds and new school d'n'b (i.e. more \"techy\", sometimes \"ghetto bass-influenced\"). There's some great 150-160bpm 4x4 d'n'b in there, as well as straight up revivalism stuff like \"Empty Bar\". Bristol's Western Lore continues its hot streak.\n\n<EmbeddedMusic title=\" Sonic - Empty Bar (Western Lore)\" iframe={<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" allow=\"autoplay\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/570099861&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true\"></iframe>} />\n\nAnd speaking about four-on-the-floor d'n'b, how 'bout we get on with the promos I've received for upcoming releases that I feel are worth mentioning. How about Fracture's _Big Up the Ladies EP_? Its titular track also does some old school/new school gap-bridging (...), starting with old school rave chords. and then dropping into a 4x4 beat with ragga vocal samples and breaks while having that \"techy\", \"twitchy\" modern feel. The rest of the release follows suit in this new \"turbo\" sound, as he's dubbed it (not joking). Although he did it much better with last year's \"Turbo Toms\", this is still solid. It comes out the 12th of April on the forward thinking club-focused Astrophonica. \"Big Up the Ladies\" has been made available.\n\n<EmbeddedMusic title=\"Fracture - Big Up The Ladies\" iframe={<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=245406130/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=small/transparent=true/\" seamless><a href=\"http://fracture.bandcamp.com/album/big-up-the-ladies\">Big Up The Ladies by Fracture</a></iframe>} />\n\n<EmbeddedMusic title=\"Fracture - Turbo Toms\" iframe={<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=1410055085/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=small/track=2187643463/transparent=true/\" seamless><a href=\"http://exitrecordsuk.bandcamp.com/album/exit081-fracture-soundboy-get-nervous-ep\">EXIT081 - Fracture - &#39;Soundboy Get Nervous&#39; EP by Fracture</a></iframe>} />\n\nSo it seems like four-on-the-flour jungle/d'n'b might be a thing now, or in the near-future? If it is, I'm expecting it to get swallowed up by the juke/trap/ghetto-inspired d'n'b DJs like Sinistarr, Valerie Molano and A.Fruits. Should be good. \n\nOn a more laid-back vibe is another label inauguration - Berlin's Sensible Seelen - with a collab by the label's founders DJ Kusse and Khshathra. DJ Kusse is actually one half of Hi & Saberhagen, whose _Light on Leaves_ from last year was a great idm-ish minimal deep house treat. On _Sensible Seelen Vol. 1, _the Berliners go for a late-night, headphones-listening kind of vibe with contemplative, melancholic house. The opener \"Into Your Soul\" sets the tone as a jazzy downtempo number. I'm not usually into this kind of stuff, but I thoroughly enjoyed it. Samo DJ and Karima F round it out with a remixes, the latter one offering something that resembles 90s' Smith & Mighty. [Snippets ](https://soundcloud.com/sensibleseelen/sensible-seelen-vol-1-snippets)are available. It comes out on the 29th of this month.\n\nFor some \"dancefloor fodder\", keep an eye out for Ejeca's new release on Unknown to the Unknown for the label's Dance Trax series, where they place their more direct and high-energy stuff. The opener \"Gilboa\" sounds like something that Peverelist would come up with if he was forced to do some 4x4 big room techno, mainly due to the main melody; or, to be more precise, like a Peverelist and Roberto collab. I could do without the Truncate remix, but it's not offensive. Snippets are available on [Juno](https://www.juno.co.uk/products/ejeca-dance-trax-vol-18/718899-01/). It comes out sometime in April according to the promo.\n\nLastly, Gary Gritness's upcoming LP, _The Legend of Cherenkov Blue, _on the Hypercolour label is about to be my first reviewed 9/10. Gritness has made it his mission to keep that ol' school funk sound alive in his electro style. The album continues in that vein, ranging from Dam Funk-esque jams to Underground Resistance-styled techno at its \"frenziest\", to Drexciya-inspired electro - all with the melodic sensibilities of retro video games. According to the promo, there's a narrative thread to the whole album, but apart for some vocal samples, it's all instrumental, so I don't care much for it. All I know is that it's a ~~g~~ood fucking time, much better than what the mighty Morphology have been cooking up these last couple of years. The album comes out on the 19th of April, so my review will be up around that time.\n\n<EmbeddedMusic title=\"Gary Gritness - The Legend of Cherenkov Blue (SNIPPETS)\" iframe={<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" allow=\"autoplay\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/582692388&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true\"></iframe>} />\n\n## The fresh smell of acetate\n\nOn to the unreleased tracks that I've just started to collect on my Youtube profile. I've done so just to have an easy way to listen to these great tracks without having to load up the mixes. Also, because I have mad respect for people that do it for, say, dubstep tracks, without whom I would never have known about certain music (all the early DMZ, Skream and Benga unreleased tracks that are amazing).\n\n<EmbeddedMusic title=\"Koehler - Winged\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/0z9uWqO6Ieg\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nI heard this on Koehler's [Groove podcast mix](https://groove.de/2019/01/11/koehler-groove-podcast-193/) from January and it blew me away instantly. Koehler is a producer whom I've always felt could make better music, even if I enjoy his stuff on Skudge and Berceuse Heroique, and even if _Oblivious Pool_ was one of my favourite releases from 2017. Well, with \"Winged\", he's answered my wish. To me, \"Winged\" is the perfect embodiment of what \"_keeping the spirit of hardcore and rave_\" means. Without resorting to retroism or revivalism (or nostalgia), he's able to conjure up the euphoria of past rave music, better than the jungle revivalists, better than the hardcore revivalists and better than the house producers currently using amen breaks (again...).  Will this get a release? Who knows...\n\n<EmbeddedMusic title=\"Impey - Conquest Mode\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/t4sU1LJvl4s\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nI love Peverelist's work, and I love the music that he's pushed on his labels, but I can't help but feel like he's been in a creative rut for about a year,  despite the consistent quality of his mixes and output from both him and his \"crew\". On his and Kowton's Livity Sound show of February on NTS Radio, they freshened things up a bit by dropping the tempo to about 110bpm for the majority of the episode, leading them to drop this, Impey's \"Conquest Mode\".  Something different for both the grime producer and techno/bass DJs . Am I crazy, or is this almost on some hyphy tip? Leftfield dubby hyphy, maybe? Anyways, I like this direction, and I've also been enjoying the recent bass music of 90-110 bpm that's been coming out these last couple of years. Even Loefah has be dabbling in some 100-110bpm stuff. It's like he says to Youngsta on their Heavyweight LDN interview a couple of months ago, \"_I feel like there needs to be something fresh right now. It's time for something fresh_.\" Will the slower tempos lead to further things? We can only wait and see, really.\n\n<EmbeddedMusic title=\"The Cyclist – Inhale Exhale (Bruce’s Deep Breath Mix) (dubplate)\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/Zs3lGFakW_Q\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nHow about this remix from UK's Bruce? To be honest, I haven't been following him for about a year and a half ever since his whole \"contemplative, emotional dance music\" phase (which means that, yes, I still haven't listened to his album from last year). But this track, taken from Hodge's Groove Podcast mix from February, makes me regret not doing so. I like the sparsity of the production, the skeletal, metallic hi-hats, the heavy kicks that punctuate the first beats and a great use of electric guitar samples. It's atmospheric, in a way, but it has some rhythmic edge to it, you know?\n\n<EmbeddedMusic title=\"AceMo & J. Albert - Untitled \" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/kJhn5CPACXk\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nHeading back to North America now. AceMo has been making some noise this past year, following his release on the Michigan label Vanity Press and his _All My Life_ collection of tracks from this year. This still-untitled J. Albert collab is the best stuff I've heard from him yet. Beautiful sparse-but-effective synthwork here. A great, steady groove with melodic, melancholic atmospherics. Now, to find out more about this J. Albert fella..."
}