{
  "publicationDate": "Jan 18, 2019",
  "title": "Kraftwerk - Music Endless",
  "mainImage": "/cms-content/uploads/title-image-1.png",
  "category": "MUSINGS",
  "summary": "Kraftwerk are considered as the forefathers of current electronic music. We go through some works that contain some of the German group's musical elements.",
  "body": "Confession: about two months ago, I wasn't familiar with Kraftwerk's discography. This is almost heresy, I know.  As someone who writes about electronic music, my unfamiliarity with them is a more than noticeable gap in my knowledge of its history. Kraftwerk's music is widely considered an important building block for all things electronic, from Synthpop, to Techno, to IDM, to Hip hop, to Electro – and beyond. Its DNA weaves itself into all these different styles and genres. And it's on that last point that I would like to expand. \n\n10 years ago, Kraftwerk's music came into the spotlight for a moment, due to the heavily promoted remastered re-releases of their classic albums (_Autobahn_ ('74), _Radio-Activity_ ('75), _Trans-Europe Express_ ('77), _The Man Machine _('78), _Computer World_ ('81)). And although they had piqued my interest, enough to listen to a couple of tracks, for some reason I never bothered to further look into them. Really, I was just too focused on listening to new music. But finally, after nearly a decade, they showed up again as my friend asked that we listen to _Computer World_ as background music when we were hanging out. And right off the bat, what jumped at me was how familiar their music actually sounded. Even more so, when that first listen prompted me to go trough their mentioned classic albums.\n\n![](/cms-content/uploads/cover-coll-1-.jpg)\n\nSpotting musical influences and lineages can be a tricky thing to do, because influences can be both direct and indirect. Sometimes you can tell, just by listening, that an artist is trying to imitate someone else's music, or trying to mix together those of their contemporaries or predecessors. Sometimes influences become clear only when an artist mentions them. And there are times when an artist's music recalls past works, scenes, or genres _without them actually knowing said works, scenes or genres_.  That's because every music piece is comprised of various bits and pieces of musical elements and ideas that are passed on from people to people, generation to generation. As Simon Reynolds once put it: “_Everything is a remix_.” Kraftwerk is considered as one of the most important groups in contemporary music. Probably more so now, with electronic music becoming extremely prominent (EDM, Hip Hop, RnB, etc, etc). The reach of their influence is almost immeasurable.\n\n<EmbeddedMusic title=\"Kraftwerk - Numbers\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/4YPiCeLwh5o\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nConsider an obvious example of Kraftwerk-influenced music, in Afrika Bambaataa & The Soulsonic Force's “Planet Rock”, from New York, released a year after _Computer World_. Following the producer's, Arthur Baker, idea for a new song, Bambaataa samples two songs from the German group: _Trans-Europe Express_' titular track, and _Computer World_'s “Numbers”; using the synth work from the former and the beat pattern from the latter. Added on top is some old school rapping,  call and response vocals, and a robotic voice singing “_Rock, rock, the planet rock. Don't stop_”. This results in an early, Electro-styled Hip Hop party anthem.\n\n<EmbeddedMusic title=\"Afrika Bambaataa & The Soulsonic Force - Planet Rock\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/9J3lwZjHenA\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nThe old school Hip Hop and Kraftwerk connection is a natural one, as the latter have expressed their love for American RnB (and Funk, notably James Brown), and that they consciously incorporated some of its beats. “Planet Rock” is a great example of how seamlessly they fuse together. \n\nBut the Germans' biggest mark on American electronic music has to be on Detroit. With the city's industrial peak still fresh in its residents' memory (leaving them fascinated with technology) and with a healthy dose of Funk, Post-Punk and German electronic music, Motor City became the birthplace of Electro and Techno (cousin genres). I come back to the famous quote from Techno pioneer Derrick May in describing the old Detroit sound: “_...like if George Clinton _\\[of Funk group, Parliament]_ and Kraftwerk were caught in an elevator, with only a sequencer to keep them company_.” And if that scenario would ever happen, maybe the results would sound something like Cybotron's 1983 single, “Clear”. \n\n<EmbeddedMusic title=\"Cybotron - Clear\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/fGqiBFqWCTU\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\n<EmbeddedMusic title=\"(to compare) Kraftwerk - Computer World 2 \" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/uuuR9hL4pgM\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nThe 90s saw a 2nd wave of Detroit producers influenced by the “Belleville Three”, the Techno and Electro originators – Derrick May, Kevin Saunderson and Juan Atkins. The Electro/Techno Duo Drexciya explored this sound further. The titles of their tracks and releases evoke an imaginary, futuristic, underwater society. One of them, “Aquabahn”, references the title of Kraftwerk's most known piece, “Autobahn”. But their music already hints at a Kraftwerk connection. Listen to their “Wavejumper” track, from their 1995 EP release, _Aquatic Invasion_: a funked-out, sped-up, Kraftwerk-esque jam.\n\n<EmbeddedMusic title=\"Drexciya - Wavejumper\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/2M1S_4fW_JE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nRecently, maybe because of Techno fatigue seeping in, Electro has shown up again on people's radar – and mine also. One of my favourite current producers in the genre is the Glasgow-based Galaxian. If Kraftwerk were optimistic futurists, reconciling Nature and Technology, Man and Machine, Galaxian goes the other way, evoking a dystopian, maybe even apocalyptic, future. The producer has never mentioned any affinities for the German group, but the title of his track “From Glasgow to Detroit”, gives us a hint of there being an indirect musical lineage.  As his track “Dosing the Population” shows, some musical resemblances are there: vocals filtered through machines; the cold, thin, repetitive, drum-programming;  an Electro beat pattern; the synth chords; the high-pitched bleeps and bloops. But, of course, if Kraftwerk's music is generally soothing, then Galaxian's is frenzied, pushing the sound to higher speeds (just over 150 bpm) and putting in an overwhelming bass line. Kraftwerk in a chaotic world.\n\n<EmbeddedMusic title=\"Galaxian - Dosing The Population\" iframe={<iframe style=\"border: 0; width: 100%; height: 120px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=1194402259/size=large/bgcol=ffffff/linkcol=0687f5/tracklist=false/artwork=small/transparent=true/\" seamless><a href=\"http://lowerparts.bandcamp.com/album/dosing-the-population\">Dosing The Population by Galaxian</a></iframe>} />\n\nLet's step away from dance music for a moment. Kraftwerk are also known for being a massive influence on the Synthpop genre, displaying a flair for pop sensibilities, incorporating melodic elements of _Schlager _(a genre of German pop music) into their compositions.  In _The Man Machine_, _Radio-Activity_ and _Computer World_, there are some tracks that can be classified as being “pop songs”. And while their music has definitely influenced 80s artists like Gary Numan, I thought we'd listen to a more recent Synthpop act, Junior Boys. The Canadian duo's 2004 debut release _Exit Boys_, adopts a Kraftwerk-esque  drum-machine percussion and bright analog synths, with a minimalist approach for the arrangements,  and adding their own touch of modern RnB vocals. \n\n<EmbeddedMusic title=\"Junior Boys - Bellona\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/GD0Kktjw7eg\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\n<EmbeddedMusic title=\"Kraftwerk - The Model\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/WzIY9iiAbfs\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nKraftwerk's DNA also finds itself in IDM (“Intelligent Dance Music”; yes, seriously), an umbrella term  for all electronic music taking elements of Techno and Electro, but putting it out of the context of the dance and making music for home-listening, with “more open-ended structures and possibilities”. Although the music can have a beat, IDM is more about creating a mood than a danceable groove, if you will. Last year saw the release of two 7th Plain compilations,  with music in the vein of IDM. And the vibe he establishes in his own work makes me think of Kraftwerk's.\n\n<EmbeddedMusic title=\"Kraftwerk - Kometenmelodie 1\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/hYPILS3jhHQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\n<EmbeddedMusic title=\"Kraftwerk - Metropolis\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/SXTBGB2cKAk\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\n<EmbeddedMusic title=\"The 7th Plain - I Think I Think Too Much\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/5qQdGY1T6eE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\n<EmbeddedMusic title=\"The 7th Plain - Reality of Space\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/-F4QnvCPyMk\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nIf Kraftwerk, following in the footsteps of German and French Electro-Acoustique musicians, would sometimes include re-creations of machine sounds into their music (like at the start of their _Radio-Activity_ album and at the beginning of “Pocket Calculator”), Japanese artist Ryoji Ikeda made it his entire aesthetic, aiming to make “glitch” music. His 2005 album [_Dataplex _](https://www.youtube.com/watch?v=HWhfZk1llUo)is composed almost entirely of skittering bleeps and bloops, and glitch and machine noises,  all set up in discernible beat patterns. As the album goes on, ambient sounds are also introduced, like in his 10-minute track “data.matrix”. (**\\*\\*Watch out for your ears!\\*\\***)\n\n<EmbeddedMusic title=\"Ryoji Ikeda - data.matrix\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/F5hhFMSAuf4\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nEven before Detroit producers were making Kraftwerk-inspired dance jams, the group's music had already some success on American dance floors, as New York House Djs in the late 70s had “Metal on Metal” in their record bag, with the track being a hit among the clubbers. The track itself is a dubbed out, instrumental version of the track that precedes it, “Trans-Europe Express”. Maybe sensing its club potential, Detroit's Carl Craig would make a re-imagining of it in his “Mind of a Machine”, a deep, four-to-the-floor Techno cut. Curiously, it begins with the sounds of a car being started, maybe in a callback to “Autobahn” (which starts the same way).\n\n<EmbeddedMusic title=\"Kraftwerk - Trans-Europe Express + Metal on Metal\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/FaBAU-8JIb8\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\n<EmbeddedMusic title=\"Carl Craig - Mind of a Machine\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/D8N8MnQzuGk\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nLastly, continuing on that Techno vibe, we'll finish with one of their countrymen, Ben Klock. A resident DJ at Berlin's Berghain (probably one of the most prestigious clubs in the world), Klock became popular at the turn of the decade for his selection of “pure”, “warm” Techno while adding his own mixing flair at the decks. Outside of the American Midwest, the Germans, alongside the British, were the first to “get” Techno, recognizing the 70s German electronic elements it had coded within it. _Berghain 04 _ was the mix CD which introduced me to the DJ. The drum-machine influence is quite apparent, as Klock goes for more “minimalist” tracks; sometimes with washes of white-noise, bleeps and bloops, and machine-manipulated vocal samples; sometimes with repetitious melodic lines and bright synths. The steady beat also recalls Kraftwerk's _motorik_, steady pulse that they had adopted from 70s Krautrock and, as previously mentioned, American RnB and Funk. And, of course, he doesn't forget the Detroit connection, including Rolando's (also from Detroit) “De Cago” which has sampled vocals repeating “_Detroit! Chicago!_”.\n\n<EmbeddedMusic title=\"Ben Klock - Berghain 04\" iframe={<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/rMNFX1diOwI\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />"
}