{
  "publicationDate": "Jan 07, 2019",
  "title": "(Some) Favourites of 2018",
  "mainImage": "/cms-content/uploads/title-image-1-.jpg",
  "category": "MIXES",
  "summary": "From dub minimalism to percussive energy, the underground bass scene continued to produce great music in 2018. And I've conveniently put some of it in this mix.",
  "body": "Well, 2018 is officially behind us now. It's done and done. Looking back, I think we aught to say that it was yet another great year for music. And I've been able to document some of it, here at The Next Groove. At mid-year, I made [a list](https://www.thenextgroove.site/article/20181201_list-current-favourite-mixes-of-2018) of my favourite mixes of the year up until that point. Then, I made myself a scorching-hot [dancehall playlist](https://www.thenextgroove.site/article/20181123_reggae-gold-no-ragga-song-spesh), the _Ragga Song Spesh_, that served as a substitute for this year's lacking Reggae Gold release, and also for the defunct Ragga Ragga Ragga compilation series. Later on, we took a look at this year's excellent [Drum n Bass compilations](https://www.thenextgroove.site/article/20181126_the-past-is-now-drum-n-bass-edition) (from the old-school to the forward thinking). And finally, a month ago now, I compiled my [ten favourite mixes](https://www.thenextgroove.site/article/20181206_the-new-hardcore-part-deux) that represent what the UK Hardcore Sound currently is.\n\nIn the grand scheme of things, it was but a tiny contribution. But seeing as those types of music are largely ignored by writers, critics, journalists, etc, from the hip sites and zines, I'm more than happy to have done my part in documenting what 2018 had the best to offer, however small a part it was. Mostly, we should be thanking all of the Youtube and Soundcloud channels, online music shops, and specialized music forums and subreddits that help us in discovering new music and in keeping track of everything.\n\nWhile I had thought that my last list would be the only “look-back” that I'd make, putting it together really gave me the itch to make another entry to the Showcase Mixes series. This one, a 23-track, hour-long overview of some my favourite electronic music of 2018.\n\n# The Mix\n\n<EmbeddedMusic title=\"2018 Favourites\" iframe={<iframe width=\"100%\" height=\"300\" scrolling=\"no\" frameborder=\"no\" allow=\"autoplay\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/555227394&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true&visual=true\"></iframe>} />\n\n<SpecialText align=\"CENTER\" size=\"SMALL\" />\n\n\\*tracklist available at end of article\n\nUnlike my previous entries, this one isn't focused on one particular artist or genre. Instead, I selected from the whole diaspora of the “130 sound” of current UK Bass/Hardcore music. (Which I talk about in [this article](https://www.thenextgroove.site/article/20181123_uk-techno-bass-percussion-bass-hard-drums-the-new-hardcore)). However, these aren't necessarily my absolute favourite tracks from that sound. A lot of them had to be added, cut, re-added, re-cut, etc. Two important things were also taken into account: 1) variety, and 2) the flow of the mix. \n\nThis past year, I was a regular listener of Livity Sound's monthly 2-hour shows on NTS Radio. Peverelist, the label boss, who's usually behind the decks for the first hour, likes to start things off with mellow, dubby tracks. I do the same as him here, easing things in with Henry Greenleaf's “In Same”, Patrick Flint's “Lean In” and M//R's “Among the Methods”: syncopated, minimalist, bass-heavy, dubby goodness. The mix then picks up with some tracks from old favourites (Peverelist and Lamont) and new discoveries (R.O.S.H. and Yaleesa Hall). The remixes for Museum's “The List” - a muscular, weighty Techno track with deformed LFOs – and Jonny L's classic “Piper” - with Peverelist's signature offbeat, bouncy subbass – are definitely in my top 10 of 2018 (if I had to make a list of individual tracks).\n\nThe midpoint mellows in a bit with Hodge's and Ishan Sound trap and grime influenced, cloud-y Dubstep beat, before Bash & T's (aka Julio Bashmore & T.Williams) deep Funky track, “EC”, picks up the energy again to start the second part of the mix, focusing on the more percussive end of the “130 sound” - from UK Funky, to Gqom (“Going Modd”), to Hard Drum (“Airplane Mode” and “2nd Guessing”), to a more tribal affair that recalls early-Dubstep (Szare's “Miner”), to anything in-between that can't be precisely classified. Finally the mix ends two ravey cuts: Mark Force's remix of Roska's classic UK Funky track “Feeline”; and JABES' heavy and ethereal “iKEA SUMMERS”. Both of them, again, unclassifiable.\n\nI'm happy with the mix, overall. It's representative of my current tastes, and it should give listeners a good idea of where underground bass and electronic club music is headed right now.\n\n**Tracklist**\n\n0:00 - Henry Greenleaf - In Same\n\n3:00 - Patrick Flint - Lean In\n\n5:56 - M//R - Among the Methods\n\n9:03 - Appleblim - Vurstep (Shed Remix)\n\n11:56 - R.O.S.H. - Will I Make the Turn\n\n15:26 - Jonny L - Piper (Peverelist Remix)\n\n17:41 - Museum - The List (Yaleesa Hall Remix)\n\n20:56 - Lamont - Dope\n\n23:56 - Sensei - Tension\n\n27:56 - Hodge & Ishan Sound - C5\n\n30:10 - Bash & T - EC\n\n32:41 - Ice Viper - Perfect Swimmer\n\n33:56 - DJ Lag & Epic B - Going Modd\n\n36:04 - Mistareez - Residue\n\n38:30 - Neana - Neans Anthem\n\n41:21 - Akito & Famous Eno - Airplane Mode\n\n42:45 - Martyn Bootyspoon - Steam\n\n44:17 - Noire - 2nd Guessin'\n\n47:00 - Lava Dome - Closer (Galtier Remix)\n\n48:50 - Akito - Wake Me Up in Paris\n\n51:00 - Szare - Miner\n\n52:30 - Roska - Feeline (Mark Force Remix)\n\n54:50 - JABES - iKEA SUMMERS"
}