{
  "publicationDate": "Mar 11, 2019",
  "title": "Carnival Sunshine to Dystopian Pulses - February Mixes",
  "mainImage": "/cms-content/uploads/coverimagetiny.png",
  "category": "PLAYLISTS",
  "summary": "If you've neglected your sound system at home, it's time to dust off that old friend, because these February mixes are sure to bring it back from the dead.",
  "body": "Well. It's now time to have a quick look-back at the mixes I enjoyed and that have come out during the month of February. Yes, I know that we're into the second week of March and that I'm even later than I was last month.  But last month ended before I had realized that it had ended, and there were still some mixes that I wanted to listen before moving on to this month's output. Those couple of extra listens weren't particularly fruitful, though, so the list ended up being short, having one less entry than the last one. Nevertheless, each of these are great listens. Let's go.\n\n_\\* Oh shit, I've just realized that the Soca mix is from last week... It probably would've ended up on the March list anyways. The important thing is that it's good. That is all._\n\n<EmbeddedMusic title=\"The Heatwave - Soca Season on Rinse FM\" iframe={<iframe width=\"100%\" height=\"120\" src=\"https://www.mixcloud.com/widget/iframe/?hide_cover=1&light=1&feed=%2Ftheheatwave%2Fsoca-season-on-rinse-fm%2F\" frameborder=\"0\" ></iframe>} />\n\nIf, like me, you've heard about this so-called \"Soca Season\" and asked yourself: \"When, exacly, is it Soca Season?\". And then you went on to google it and found no clear answers whatsoever (it seems like soca afficionados on forums aren't ever sure themselves...), well, now we know, at least for this year. It's just passed. \n\nGabriel Heatwave (whose King Tubby tribute mix made an appearance in last month's list) brings us the hits from this year's season of carnivals. There are some absolute gems here, like Patrice Robert's \"Like it Hot\", Nessa Preppy's \"Issa Snack\", and \"Party Start\" courtesy of Swappi & Ultimate Rejects. 1 hour of bright, upbeat goodness from the UK dancehall selector.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Szare - 2nd February 2019 (NTS Radio)\" iframe={<iframe width=\"100%\" height=\"120\" src=\"https://www.mixcloud.com/widget/iframe/?hide_cover=1&feed=%2FNTSRadio%2Fszare-2nd-february-2019%2F\" frameborder=\"0\" ></iframe>} />\n\nI promised the sunshine, now here's the gloom, though it is no less frenetic. Szare, whose oriental-flavoured riddim \"Miner\" is one my favourite tracks from these last few months, plunges into colder, darker vibes, going from the minimal and industrial techno of Clouds, to twitchy idm-ish tribal affairs, to the deep dystopian roller of Kenya's Slikback. Szare's mix straddles the line between chin-stroking home-listening and neurotic danceabilty, staying engaging the whole way through. And it gets extra points for making me realize that I'm still not completely bored with the industrial and ebm sounds that you currently can't escape from in underground electronic music.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Trends B2B Boylan B2B DOK With Novelist & Manga St Hilare - PyroRadio - (04/02/2019)\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/BEjDra2RY3A\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nGrime hasn't been the flavour of the day for quite some time now, being recently usurped by the still-rising UK hip hop/UK drill/afroswing scene, but this 30-minute set gets everything right. It's got two of the best new age dj/producers (Trends and Boylan) behind the decks, and two of the best new age MCs on the mics. It's short  and sweet, the DJs keep the energy levels up, and they keep things surprising and exciting for the MCs, juggling between new age trappy sounds and bouncy, jump-up riddims that don't care if they sound ridiculous. Also, for my money, grime is at its best on live sets (as opposed to albums).\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Flora Yin-Wong | Keep Hush Live: Nice One Takeover\" iframe={<iframe width=\"560\" height=\"266\" src=\"https://www.youtube.com/embed/U7jD_wZzxko\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nYou'll probably recognize the Keep Hush youtube channel, who seem to have taken it upon themselves to replicate the atmosphere of old Boiler Room circa 2010, pushing out underground UK sounds (without getting the deluge of downvotes from the house and techno purists that are now Boiler Room's main audience) . Although they don't promote new genres enough for my liking, their recordings have stayed consistent in quality.\n\nLast month, they invited over Flora Yin-Wong, who I know nothing about, to be honest. Admittedly, the first couple of minutes here are kind of dead lol. But boy does it pick up, with Nazar's ice-cold and heavy \"Airstrike\" beautifully setting the mood for the 100bpm (ish) section. The dancehall and reggaeton tempo has become a fixation for more and more underground djs and producers these last couple of years, and Flora shows us why. She ends her short set in style with some UK Funky/Hard Drum vibes.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Kyam - Artist Mix #011 for Ronin Ordinance\" iframe={<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" allow=\"autoplay\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/569059542&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true\"></iframe>} />\n\nSpeeding things up with some good ol' DnB. There isn't much info about Kyam. All I know is that he's released one of my favourite tracks of this year, so far, in his \"[VHX](https://soundcloud.com/kyamofficial/vhx)\", and that he seems to be good selector. Sure, he isn't re-inventing anything here. But in just under 1 hour, Kyam goes through various styles of deep, heavy Dnb and Jungle (as a commentator has already remarked), even adding in a hardcore techno/gabber track like if it was a Helkter Skelter set, and keeping things fresh the whole way through.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Yilan - Newtype Rhythms #72 - Special Guest Mix\" iframe={<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" allow=\"autoplay\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/575029449&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true\"></iframe>} />\n\n_His mix starts at around 44:30_\n\nA mix to promote his new release _Diaspora. _Yilan is a producer/dj from the UK who's focused on the deep techno sounds from over there, similar to the likes of Yak, Henry Greenleaf, Madam X... Here he's able to achieve a great balance between atmospheric vibes and heavy ones, having recourse to more than a handful of unreleased tracks, which includes Yak's tribal material in his \"Kaepora\", and a dangerous collab between Manga (yes, that same grime MC) and Mikes Drones & Padawan Sound.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"East Man - Stush!\" iframe={<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" allow=\"autoplay\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/575866695&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true\"></iframe>} />\n\nWe started this list with some modern Soca, now let's end it with some old school 90s ragga/dancehall. For those that don't know, East Man is Anthony J Hart's (aka Basic Rhythm) alias under which he fleshes out a [revamped take](https://www.youtube.com/watch?v=B7Dy8RQSjcs) on those old school, gritty, skeletal white label grime beats with his own \"cleaner\" production. There's no info about his \"Stush!\" mix, but to my ears, this seems to be a collection of proto-grime ragga tunes. You can hear it in the sparse arrangements with syncopated heavy drums and cold synths. Even some early grime MCs like God's Gift and MC Viper had a heavy ragga-influenced delivery style. Also, we can hear how these type of tunes _still _inform a lot of current underground UK bass music (like, say, Yilan's for example). Immortal sounds."
}