{
  "publicationDate": "May 15, 2019",
  "title": "D1 and the Post-Dubstep era (2007-2012)",
  "mainImage": "/cms-content/uploads/cover.jpg",
  "category": "MIXES",
  "summary": "Looking back at D1's overlooked melodic side to dubstep that he was producing during the post-dubstep years.",
  "body": "****[**Loefah, with DJ Youngsta and Sgt. Pokes, on club night FWD>> (dubstep's birth place) before 2005:**](https://www.youtube.com/watch?v=rnIP6Ug6D0o)\n\n> _**Loefah**_: _“One of the good things about FWD>> back then was that - you know what I mean? - you didn't know what you were getting into._\n>\n> **_Sgt. Pokes_**: _“There were no expectations, innit? You just went down there, and you found your little spot”_\n>\n> _**Youngsta**_: _“Yeah, massive diversity!”_\n>\n> _**Loefah**_: _“It became 'dubstep', and then dubstep had rules. Before that we were just writing beats. Some called it 'dubstep', some called it 'one-three-eight'...”_  2013\n\n****[**Paul, from the Deeptime blog, in 2007**](http://www.deeptime.net/blog/?p=224)**:**\n\n> _“Maybe it’s time to revive ‘Forward Sound,’ though maybe in the plural. Circa 2003 that was the open-ended term that used to describe what eventually became dubstep, along with a tangle of threads that split off or got left behind. Just like house first meant “what they play at the Warehouse,” it was a reference to the club night itself, the only place where you could hear as yet unnamed new mutations of the \\[UK] Garage machine \\[...]._ \n>\n> _It seems like there is a real convergence going on between all the (not so) different London scenes; grime, dupstep, UKG, bassline and funky house are all being appreciated by DJs and clubbers who claim to be into different sounds._\n\n<SpecialText align=\"LEFT\" size=\"NORMAL\" />\n\n**And Martyn (3024 label-head) in the comments**\n\n> _“I think perhaps for people who have not experienced the early FWD>> years and who are making music in 2007, they can either pick their influences out of what is now called “Dubstep. \\[...] I think we can both come up with a list of names of people that are making a really exciting blend of early 00’s UKG and really diverse sounds from house/techno and whatnot..”_\n\n****[**Loefah, on quitting dubstep and his direction with his label Swamp 81 in late '00s:**](https://www.youtube.com/watch?v=u-R0htdSOcY)\n\n> _“I was part of “dubstep”, which was something I truly loved and really enjoyed. But then it got to a point where it didn't translate to my ears. \\[...] There was a thing going on in London at the time which reminded me of the energy that happened when we started DMZ. \\[...] Hessle \\[Audio] had moved into something that was really interesting – same with Night Slugs. It was a really, sort of, fresh club feel in London. It didn't necessarily need a name – it didn't need anything, it had a vibe. That's initially what Swamp was about: to get, sort of, a part of that energy, and, yeah, moving forward, I suppose.”_ 2018\n\n**Random commentator on Discogs on Hyetal's 2010 release** [**Phoenix**](https://www.youtube.com/watch?v=oWuNNXLL93M)**:**\n\n> _“I'm sorry to disagree here with the style tag, if this is dubstep then everything is...”_\n\n**And a retort:**\n\n> _\"Sorry bruh to disagree with your disagreement, but it IS 140bpm Bass Music. Seen? Peace.”_\n\n****[**D1, on the “post-dubstep” term:**](https://hyponik.com/features/building-blocks-d1/)\n\n> _“I don’t think it’s good. I understand why people do it but I personally don’t think its good, it should just all be under one umbrella. I think there’s room for all types of dubstep and I would prefer to see more line-up’s that were diverse as well, that has a bit of everything that dubstep has to offer. I think the sub genres are just confusing and restricting as a producer, I make music that I like, that I would call dubstep.”_\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n_\\[May 28th update: I figured I should clarify what I mean by \"post-dubstep\", because I realize that some people attribute it to a more specific sound and era, namely the kind of rnb/dubstep stuff of 2009-2012 from the likes of James Blake, Jamie xx and Sbtrkt. To me, I refer as post-dubstep all of the hybrid era of 2007-2012 (which includes the rnb-ish stuff).]_\n\n//\n\nAt the turn of the decade, dubstep was in a weird place. Confusion happened. While Mary Ann Hobbs' curated _Dubstep Warz_ and Digital Mystikz' _Essential Mix_ had rallied a new set of fans behind the dubstep banner in 2006 (introducing a global audience of music geeks to what seemed back then like the first, great new genre of the 21st century), it wasn't long until different new takes on the classic sound started to enter the scene. To give a couple of examples: In 2007, two of the biggest electronic releases, [_Untrue_ ](https://www.youtube.com/watch?v=LHtNPzaHO7k)and [_FabricLive 37_](https://www.youtube.com/watch?v=eGNvjEuZzN4), were presented to the world as “dubstep”; in 2008, producers like [Joker ](https://www.youtube.com/watch?v=FZ8pWDj3AX0)and Gemmy showed off their neon-lit, g-funk-influenced gloss painted over the classic dubstep sound; in 2009, the popularity of Joy Orbison's “[Hyph Mngo](https://www.youtube.com/watch?v=Aa_PDKKc2_A)” (re)introduced a great number of people to the _garridge_ pulse... within the dubstep scene.\n\nOf course, the _FabricLive 37_ wobblefest, wub wub style would quickly become its own thing entirely, evolving into the “transformers” brostep sound that would spearhead the global EDM/Rave explosion of '09-'10 (and quickly be dismissed by critics, hipsters, dubsteppers and some older ravers). Everything else, though, seemed to live within the same space (or within the same network). As the quotes above suggest, since about 2007, people were contesting dubstep's South London/Croydon hegemony. A new wave occurred: new and old labels like Hessle Audio, Hotflush, 3024, Punch Drunk, Apple Pips, Hyperdub started to dive into this “post-dubstep” hybrid sound, where 2-step garage, house, techno, idm, jungle, hip hop, footwork/juke etc, etc could be thrown into the genre that had come out of the FWD>> club night.  \n\nBut “post-dubstep” is not a genre, nor was it an organized movement under that banner. It was a term used by fans, critics and bloggers to point to this ambiguous territory that certain artists had entered, taking those mentioned genres and passing them through the filter of dubstep synthesis. Stylistically, it was peripheral to dubstep (i.e. Deep Medi, Tempa, Boka, Osiris Music, Tectonic, Contagious, Ringo, etc), but it also became a central point of interest since music publications like Pitchfork, Fact Mag and Resident Advisor certainly took a great liking to it and hyped it. So the Pitchfork hipster reader that was spellbound by Shackleton's Fabric 55 and Martyn's Fabric 50, probably wasn't too bothered by Deep Medi's output or Youngsta's _Minimal Mondays_ on Rinse. The dubstep heads (even new ones like me) were most likely listening to all of it.\n\nIt was dubstep, but it wasn't dubstep. \n\nWas it “UK bass? Or was it “post-dubstep”? \n\n“And what about this new 'future garage' thing?” \n\nIt was confusing times, but that confusion was the result of the exciting concentrated surge of creativity that was happening then (mostly in London and Bristol). It was the start of this new ambiguity of “what do we call this?” and quasi-scene(s) that has defined underground UK bass music in the 2010s, where artists consciously avoid being pigeonholed into a clear-cut, defined genre and scene. I'm mostly thinking of the techno-and-electro-via-dubstep's-loose-sine-wave pushed by labels like Livity Sound, Timedance, Mistry, Tempa (at one point), Kaizen, Swamp 81, Jelly Bean Farm, Durkle Disco, Hessle Audio, Wisdom Teeth, Berceuse Heroique (to a certain extent), Hemlock, Whities etc. All of them promoting versatile music that can fit into any sort of techno set these days, but which, at least to my ears, owes a lot to this post-dubstep era (or maybe even exists because of it).\n\nI wouldn't be thinking about all of this this if it wasn't for D1's music, which I came across again through Youtube. But it wasn't the darkside, Youngsta-approved stuff that held my attention. It was his lighter side, like the sunny 2-stepper “Atmosphere”, the old school house chords and rave stabs of “Jus Business”, and the bubbly and emotive rollage of “Joy”. Music that he'd been making during this post-dubstep era, but which was never referenced within that framework; upon listening to it, could've found its place within it.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\nPart of the classic dubstep vanguard, D1 was sneaking into the FWD>> night at the age of 15, soaking up the dark and dubby garage mutations of Horsepower Productions, Zed Bias, El-B and whatever DJ Hatcha would play (mostly the earliest Skream and Benga dubplates). He would go to the now-closed Black Market Records shop where he became friends with one of its employees, Daniel Lockhart aka DJ Youngsta, who encouraged him to get into production. In 2004, at the age of 16, he signed with the pioneering label Tempa; and his “Crack Bong” would be released on an EP alongside tracks from big names Kode9, Geeneus and El-B and new faces Loefah and Mala. He would form an alliance with Youngsta, who gave him pointers into how to perfect his sound according to his own vision (which culminated with the _Dubstep Allstars 2_ mix cd) and who presumably had first dibs on D1's fresh unreleased dubplates. His style became an important contribution to the formation of the South London sound (even though he came from West London): the dark and dubby,  Croydon dreadstep which would submerge FWD>> attendees in overwhelming subbass. One of his own tracks would serve as the opener to the Dubstep Warz one-off special broadcasted on BBC Radio 1 in 2006.\n\nD1 grew up in a musical family and learned to play the piano and the saxophone at a very young age. Maybe because he approached his beat-making in terms of chord progressions and harmony, and because he had a wide range musical interests, he grew weary of the classic sound that he had helped shape and personally felt like he'd become creatively stagnant. He sought to take a more “melodic” approach to the “140 bpm sound”. By 2008, his creative partnership with Tempa and Youngsta came to an end and he joined Caspa's Dub Police/Sub Soldiers crew, where he experimented with a dubstep sound inspired by Diplo, Redlight, old school rave, and house (à la Herve and Switch from the Dubsided label).\n\nHis joining of the Dub Police label was, stylistically at least, a weird one. Caspa (also a FWD>> attendee since the early days) had already begun his transition towards the brostep sound with his label, while D1, who occasionally made the odd wobble tune here and there, mostly dabbled into this “brighter” style. Brostep was aggressive and very macho with a I-don't-give-a-fuck ethos. D1's music was heavy, yes, but it was more “groove-based”, rhythmically intricate, putting his percussive flair to great use without any sign of macho-ism or aggression; instead it could have melancholic and emotive melodic sensibilities. Sometimes his synths have a weightless, ethereal yet euphoric quality to them, like if they had been taken from an ambient house, idm or, even, a new age record. According to D1 himself,  the opening track of this mix, “Identify”, “felt like trying to make trance”. It was a hint of things to come from the West London producer.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\nThis showcase mix was made to put D1's melodic “140 sound” side by side with “post-dubstep” music to shape a diverse-yet-uniform vibe. His tracks in this mix come from his late-Tempa output, his Dub Police material, and from a batch of freebies released through Hedmuk's blog (neatly put in playlists by a kind Youtube user). I tried to get a wide range of artists and labels that would fit in this mix, without breaking the flow too much. We've got Martyn, Brackles, TRG (Cosmin' TRG, that is) and Peverelist doing neo-Detroit-via-UK vibes on the 3024 label, Appleblim's Apple Pips label, Ben UFO's and Pearson Sound's Hessle Audio, and Pev's own Punch Drunk. Also from Punch Drunk is Hyetal's and Shortstuff's (aka Mickey Pearce) sugary-sweet take on the purple sound. Addison Groove (aka Headhunter) comes through with the drum-machine Juke sound on Swamp 81. Untold's weird little number, “Gonna Work Out Fine” from his own label Hemlock, is an early sign of the extreme-percussion-ponctuation that will show up in underground club/uk bass/deconstructed circles throughout the 2010s (even Scratcha's recent Soul Destroyer remix of Basstone). That's preceded by a Night Slugs jam in Bok Bok and Cubic Zirconia's “Reclash (Dub)”. And, finally, I included a track from one of his Dub Police label-mates, Emalkay: the overlooked gem and b-side to “When I Look At You”, “A.G.S. (Angie Got Stoned)”.\n\nBut this mix is also, for me, a chance to reminisce about those times. You see, dubstep was my first love in electronic music, and I first got into it, earnestly, when all this nonsense was going on. A few months ago, when I first heard D1's “3d Sense” and “Mk 66” from the freebies pack, then discovered everything else from this mix (except “Identify”, I was already well familiar with that one), I was immediately transported back to 8-10 years ago when I discovered all these dubstep/post-dubstep sounds,  when I would listen to it on Youtube and Grooveshark until 3-4 am, downloading Rinse podcasts (the former pirate radio station had just got its licnse) and putting them on my non-Apple mp3 player, and listening to them on the bus with shit headphones on my way to the Cégep (and on the trip home, of course). I still hadn't gone to a club yet, so that was how I experienced this music back then. And I loved every second. Some of it holds up, some of it doesn't. Maybe some of it (post-dubstep) was contrived, but it was certainly a breath of fresh air after spending about 2 years listening to jazzy hip hop instrumentals from Japanese producers and US beat-tapes (Oh No, Madlib, J Dilla) and not being familiar at the time with jungle, dnb, techno, idm, garage, house.\n\nSo I hope you enjoy. Some of these D1 tracks (“Joy”, “Identify”, “Forever remix”) are some of my favourites from the dubstep diaspora in general\n. And while I do hope some of you will feel some nostalgia for this music, for the love of God, I also hope no one starts \"bringing it back\". There's enough revivalism as is.\n\n_\\*\\*Check bottom of article for additional links_\n\n<EmbeddedMusic title=\"The Mix\" iframe={<iframe width=\"100%\" height=\"300\" scrolling=\"no\" frameborder=\"no\" allow=\"autoplay\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/621429525&color=%23056ba6&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true&visual=true\"></iframe>} />\n\n<Tracklist tracksStr={[{\"startTime\":\"00:00\",\"artist\":\"D1\",\"trackName\":\"Identify (Tempa)\"},{\"startTime\":\"4:08\",\"artist\":\"Martyn\",\"trackName\":\"Twenty Four (3024)\"},{\"startTime\":\"6:10\",\"artist\":\"D1\",\"trackName\":\"3rd Sense (hedmuk downloads)\"},{\"startTime\":\"8:55\",\"artist\":\"D1\",\"trackName\":\"Organ Grinder (hedmuk downloads)\"},{\"startTime\":\"12:07\",\"artist\":\"Bok Bok & Cubic Zirconia\",\"trackName\":\"Reclash (Dub) (Night Slugs)\"},{\"startTime\":\"14:24\",\"artist\":\"Untold \",\"trackName\":\"Gonna Work Out Fine (Hemlock)\"},{\"startTime\":\"16:00\",\"artist\":\"D1\",\"trackName\":\"Cave (Tempa)\"},{\"startTime\":\"18:44\",\"artist\":\"TRG\",\"trackName\":\"Broken Heart (Hessle Audio)\"},{\"startTime\":\"20:55\",\"artist\":\"D1\",\"trackName\":\"Joy (Tempa)\"},{\"startTime\":\"25:08\",\"artist\":\"D1\",\"trackName\":\"I'm Lovin' (Dub Police)\"},{\"startTime\":\"26:58\",\"artist\":\"Brackles\",\"trackName\":\"Lizards (Apple Pips)\"},{\"startTime\":\"28:50\",\"artist\":\"Peverelist\",\"trackName\":\"Not Yet Further Than (Punch Drunk)\"},{\"startTime\":\"31:30\",\"artist\":\"D1\",\"trackName\":\"Jus Business (Dub Police)\"},{\"startTime\":\"33:30\",\"artist\":\"Emalkay\",\"trackName\":\"A.G.S (Angie Got Stoned) (Dub Police)\"},{\"startTime\":\"36:30\",\"artist\":\"D1\",\"trackName\":\"Mk 66 (hedmuk downloads)\"},{\"startTime\":\"38:40\",\"artist\":\"D1\",\"trackName\":\"All in Da Swing (hedmuk downloads)\"},{\"startTime\":\"40:40\",\"artist\":\"Addison Groove\",\"trackName\":\"Dumbshit (Swamp 81)\"},{\"startTime\":\"42:32\",\"artist\":\"Hyetal & Shortstuff\",\"trackName\":\"Ice Cream (Punch Drunk)\"},{\"startTime\":\"45:30\",\"artist\":\"Conquest\",\"trackName\":\"Forever (D1 Remix) (Dub Police)\"}]} />\n\n//\n\n_Both freebies packs are available on Youtube playlists. There's some bad stuff, some good, some great:_\n\n[Unreleased Beats Vol. 1](https://www.youtube.com/playlist?list=PLx_49j3-dzWMM4sGZp0EPc4RsSWSffhZj)\n\n[Unreleased Beats Vol. 2](https://www.youtube.com/playlist?list=PLx_49j3-dzWMUz56C0mnu33Q3P3n1Tr4N)\n\n_At some point, D1 changed his alias to Oscar Luweez, transitioning to straight up house, taking part of the early-to-mid 2010s' deep house/tech house revival in London. He seems to have disappeared after this...:_\n\n<EmbeddedMusic title=\"Oscar Luweez - Be Mine\" iframe={<iframe width=\"560\" height=\"100\" src=\"https://www.youtube.com/embed/Cpnp5iLDtjo\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\n<EmbeddedMusic title=\"Oscar Luweez' Vagabonz Valentines Mix\" iframe={<iframe width=\"100%\" height=\"60\" src=\"https://www.mixcloud.com/widget/iframe/?hide_cover=1&mini=1&feed=%2Fpacklondonbass%2Foscar-luweez-vagabondz-valentines-mix%2F\" frameborder=\"0\" ></iframe>} />"
}