{
  "publicationDate": "Feb 06, 2019",
  "title": "It's All About the Echo Chamber - January Mixes",
  "mainImage": "/cms-content/uploads/title-pic.jpg",
  "category": "PLAYLISTS",
  "summary": "Sharing eight mixes from January that I think you guys should listen So it's time to turn on your sound systems (and don't go easy on the bass knob).",
  "body": "Well the the first month has passed, and already there were some memorable mixes to be released. Actually, why shouldn't there be? I don't know how many hours of DJs sets and mixes are uploaded every week (or day), but at this point, it has to be a huge fucking number. So I thought I'd make a list of the things I've enjoyed, to give people a glimpse into what is worth their time (I hope).\n\nI don't know if I'm going to make a regular series out of this. Like a lot of things on this blog, I partly do it for myself. In this case, I'd though I'd do a quick look-back at the month of January, in terms of the mixes that have left an immediate impression. If I'm to make a year-end list like I did with 2018, then this initiative also makes the final choosing process a lot easier. Yet, as a digger, I'll probably stumble upon something that I somehow missed and that, yes, probably should have been here. Doesn't matter. This is what I've enjoyed the most from January, as of now. It's a pretty solid list.\n\n<EmbeddedMusic title=\"Truancy Volume 233: Peverelist\" iframe={<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" allow=\"autoplay\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/564031296&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true\"></iframe>} />\n\nI've already expressed my [great appreciation](https://www.thenextgroove.site/article/20181104_peverelist-s-bass-music-jungle-re-contextualized) for Peverelist's work, so I don't think I'll indulge into praising the man once more. What I will say is that if, like myself, you've never had to opportunity to catch him live (as he rarely ventures out of the UK and Europe), then he's offered a great sneak peak into what his “club-oriented” sets sound like. If you've been tuning into his monthly Livity Sound show on NTS Radio, and if you've listened to the mixes he's released online for the last decade, then you' know that he likes to keeps things “dubby”, “chilled-out”, only intensifying the energy momentarily. This mix starts out that way but quickly shifts into a skanking, percussive, bassy affair, sometimes hinging close to the Hard Drum vibe. A real treat from the legendary Bristol DJ, producer and label head.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Strategy (100% Strategy productions) DJ set | Keep Hush Manchester: Strategy presents\" iframe={<iframe width=\"560\" height=\"264\" src=\"https://www.youtube.com/embed/Lsmy8UD-i1U\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>} />\n\nI honestly don't know much about Strategy, other than the fact that he's released a DnB record on Exit last year. What drew me to listen to this set was actually Chunky's presence as the host MC. Remember Chunky? Lately, he's been doing his thing with a Manchester-based Hip Hop collective, but back in the early years of this decade, he was the voice of Swamp 81 (when it was one of the coolest and most influential labels in UK underground club music), donning the mic, with Loefah on the decks spinning some spaced-out Electro and Techno. In recent years, due to changing tastes, I feel as if MCs in UK club music have largely been pushed to the margins. Chuncky has also dropped out of the Swamp 81 crew, so it's great to hear his voice again. But I also enjoyed the music itself here. Composed entirely of his own (unreleased) productions, Strategy dips into the 124 bpm territory, venturing into rude House and Funky rhythms, deep UK Techno and halftime beats à la Dubstep.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"The Heatwave - King Tubby Special - 30th January 2019\" iframe={<iframe width=\"100%\" height=\"120\" src=\"https://www.mixcloud.com/widget/iframe/?hide_cover=1&light=1&feed=%2FNTSRadio%2Fthe-heatwave-30th-january-2019%2F\" frameborder=\"0\" ></iframe>} />\n\nAlong with David “Ram Jam” Rodigan, Gabriel Heatwave's selection is responsible for my appreciation of Dancehall and all things Reggae. He used to have a weekly show on Rinse FM a few years ago, but lately he's been focused on his Hot Wuk live shows and getting back into production, bringing him to only do monthly shows for both Rinse and NTS. In this month's episode for NTS, he commemorates the work and influence of King Tubby on the week of the 30th anniversary of his murder in Jamaica. Offering one hour of King Tubby-produced songs (mostly Roots and Dub), Gabriel Heatwave briefly explains his influence on the concept of the “remix” and of “producing for MCs” (as opposed to singers). A great listen.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Henry Greenleaf: 11th January '19 - Noods Radio\" iframe={<iframe width=\"100%\" height=\"120\" src=\"https://www.mixcloud.com/widget/iframe/?hide_cover=1&light=1&feed=%2FNoodsRadio%2Fhenry-greenleaf-11th-january-19%2F\" frameborder=\"0\" ></iframe>} />\n\nHenry Greenleaf made a appearance in my previous list. As I've stated, he started out as a DnB producer but has made the transition into the UK Techno scene. In this set for Noods Radio, the music is like Greenleaf's own production: weighty, direct, sparse but energetic, and owes to old school Dubstep and Drum n Bass as much as it does to Berlin Techno. What we get here is 2 hours of rolling beats ranging from the dark and minimal to the upbeat and melodic, with quite a handful of dubplates for good measure.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Akito w/ Yetsuby - 11th January 2019 - NTS Radio\" iframe={<iframe width=\"100%\" height=\"120\" src=\"https://www.mixcloud.com/widget/iframe/?hide_cover=1&light=1&feed=%2FNTSRadio%2Fakito-11th-january-20191%2F\" frameborder=\"0\" ></iframe>} />\n\nThe Sans Absence label boss consistently starts off the new year in a great way with this set for NTS Radio. Also making a second appearance in my lists, he continues with the tribal and funky side of Hard Drum. His guest DJ from South Korea, Yetsuby, takes over for the second half. While her selection doesn't have the strong tribal and percussive leanings of Akito, she hones in on the current UK sound of bass music, packing in a cohesive and diversified set of beats. I didn't know her at all before listening to this show, but I've got to look her stuff up now.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Reclaim Your City - 12 Janvier 2019 - Rinse France\" iframe={<iframe width=\"100%\" height=\"120\" src=\"https://www.mixcloud.com/widget/iframe/?hide_cover=1&light=1&feed=%2FRinseFrance%2Freclaim-your-city-12-janvier-2019%2F\" frameborder=\"0\" ></iframe>} />\n\nI came across these guys through some of my favourite producers and DJs who have made guest mixes for this show. Admittedly, I don't really know anything about them, other than the fact that it's a label of the same name which focuses on “the best underground techno from around the globe \". I'm not nearly into the current, “conventional” side of Techno as I was once, but what I love about these guys is that they stay on top of things in the Techno world, and every week on Rinse France they present their own “best of” from what the genre currently has to offer. The last third of this 2-hour show strays into more experimental and leftfield territory, adding a refreshing palette to your typical 4/4 straight Techno. And their sequencing and seamless blends keep things engaging.\n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Keysound - 24th January 2019 - Rinse FM\" iframe={<iframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" allow=\"autoplay\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/564396774&color=%23ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false&show_teaser=true\"></iframe>} />\n\nUK Bass, UK Techno, 130 Sound, whatever it's called -  for the last few years, the main cyber-exporter of this music has been the Keysound show on Rinse FM, with listeners from all over the world (especially the States) locking in to hear what it has to offer that is both fresh and exciting. The show is named after the record label run by Blackdown and Dusk, who became active in the UK underground club scene way back when Dubstep was still in its initial stages and didn't yet have an official name. Blackdown actually runs a [blog](http://blackdownsoundboy.blogspot.com/), which, although currently only semi-active, became an important and influential space in which he could commentate on the nascent scene of Dubstep. Now, as they did back then, they focus on the “new”. At around the end of the first hour, they slip in a few El-B tracks, and Blackdown (I think) remarks: “_His music is why I started to produce music of my own in the first place_”. El-B's work is considered as being a fundamental building block of Dubstep, but this set also demonstrate how the new stuff stills owes a lot to it. El-B's style of UK Garage – infectious grooves, swaggering syncopation, dark atmospherics and bouncy subbass – weaves itself seamlessly into the fresh sounds. \n\n<SpecialText align=\"CENTER\" size=\"undefined\" />\n\n♪\n\n<EmbeddedMusic title=\"Kaizen w/ Madam X & AQXDM - 31st January 2019 - NTS  Radio\" iframe={<iframe width=\"100%\" height=\"120\" src=\"https://www.mixcloud.com/widget/iframe/?hide_cover=1&feed=%2FNTSRadio%2Fkaizen-31st-january-2019%2F\" frameborder=\"0\" ></iframe>} />\n\nAlong with Keysound's show on Rinse Fm, Madam X' monthly Kaizen show on NTS Radio has become a must-listen for fans wishing to get a taste of the bassy UK Techno that she's been pushing for many years now, as a DJ and label boss. And while it is true that she's been including more conventional 4/4 warehouse techno and jacking House beats into her sets (in part, probably taking away from what made her unique in the global scene), it hasn't taken away from the strength of her selection (she also seems to have the pull to get unreleased exclusive material from UK bass/techno producers), and, mainly, from her innate talent in blending and sequencing the tracks. When she's on, the music becomes more riveting and powerful, sometimes even if you've already heard the tracks before to lesser effect. It's why she's become an underground club hero in the UK scene. She's joined on the second hour by a guest mix from AQXDM – duo composed of  Deapmash, and Toronto-native and Berlin-based Aquarian -  who also delve into the weighty sounds of UK Techno."
}